rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
  uint8_t RESERVED_45[12];
  __IO uint32_t MTL_EST_CONTROL;                   /**< offset: 0xC50 */
  __IO uint32_t MTL_EST_EXT_CONTROL;               /**< offset: 0xC54 */
  __IO uint32_t MTL_EST_STATUS;                    /**< offset: 0xC58 */
  uint8_t RESERVED_46[4];
  __IO uint32_t MTL_EST_SCH_ERROR;                 /**< offset: 0xC60 */
  __IO uint32_t MTL_EST_FRM_SIZE_ERROR;            /**< offset: 0xC64 */
  __I  uint32_t MTL_EST_FRM_SIZE_CAPTURE;          /**< offset: 0xC68 */
  uint8_t RESERVED_47[4];
  __IO uint32_t MTL_EST_INTR_ENABLE;               /**< offset: 0xC70 */
  uint8_t RESERVED_48[12];
  __IO uint32_t MTL_EST_GCL_CONTROL;               /**< offset: 0xC80 */
  __IO uint32_t MTL_EST_GCL_DATA;                  /**< offset: 0xC84 */
  uint8_t RESERVED_49[8];
  __IO uint32_t MTL_FPE_CTRL_STS;                  /**< offset: 0xC90 */
  __IO uint32_t MTL_FPE_ADVANCE;                   /**< offset: 0xC94 */
  uint8_t RESERVED_50[8];
  __IO uint32_t MTL_RXP_CONTROL_STATUS;            /**< offset: 0xCA0 */
  __IO uint32_t MTL_RXP_INTERRUPT_CONTROL_STATUS;  /**< offset: 0xCA4 */
  __I  uint32_t MTL_RXP_DROP_CNT;                  /**< offset: 0xCA8 */
  __I  uint32_t MTL_RXP_ERROR_CNT;                 /**< offset: 0xCAC */
  __IO uint32_t MTL_RXP_INDIRECT_ACC_CONTROL_STATUS; /**< offset: 0xCB0 */
  __I  uint32_t MTL_RXP_INDIRECT_ACC_DATA;         /**< offset: 0xCB4 */
  __I  uint32_t MTL_RXP_BYPASS_CNT;                /**< offset: 0xCB8 */
  uint8_t RESERVED_51[4];
  __IO uint32_t MTL_ECC_CONTROL;                   /**< offset: 0xCC0 */
  __I  uint32_t MTL_SAFETY_INTERRUPT_STATUS;       /**< offset: 0xCC4 */
  __IO uint32_t MTL_ECC_INTERRUPT_ENABLE;          /**< offset: 0xCC8 */
  __IO uint32_t MTL_ECC_INTERRUPT_STATUS;          /**< offset: 0xCCC */
  __IO uint32_t MTL_ECC_ERR_STS_RCTL;              /**< offset: 0xCD0 */
  __I  uint32_t MTL_ECC_ERR_ADDR_STATUS;           /**< offset: 0xCD4 */
  __I  uint32_t MTL_ECC_ERR_CNTR_STATUS;           /**< offset: 0xCD8 */
  uint8_t RESERVED_52[4];
  __IO uint32_t MTL_DPP_CONTROL;                   /**< offset: 0xCE0 */
  __IO uint32_t MTL_DPP_ECC_EIC;                   /**< offset: 0xCE4 */
  uint8_t RESERVED_53[24];
  __IO uint32_t MTL_TXQ0_OPERATION_MODE;           /**< offset: 0xD00 */
  __I  uint32_t MTL_TXQ0_UNDERFLOW;                /**< offset: 0xD04 */
  __I  uint32_t MTL_TXQ0_DEBUG;                    /**< offset: 0xD08 */
  uint8_t RESERVED_54[8];
  __I  uint32_t MTL_TXQ0_ETS_STATUS;               /**< offset: 0xD14 */
  __IO uint32_t MTL_TXQ0_QUANTUM_WEIGHT;           /**< offset: 0xD18 */
  uint8_t RESERVED_55[16];
  __IO uint32_t MTL_Q0_INTERRUPT_CONTROL_STATUS;   /**< offset: 0xD2C */
  __IO uint32_t MTL_RXQ0_OPERATION_MODE;           /**< offset: 0xD30 */
  __I  uint32_t MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT; /**< offset: 0xD34 */
  __I  uint32_t MTL_RXQ0_DEBUG;                    /**< offset: 0xD38 */
  __IO uint32_t MTL_RXQ0_CONTROL;                  /**< offset: 0xD3C */
  __IO uint32_t MTL_TXQ1_OPERATION_MODE;           /**< offset: 0xD40 */
  __I  uint32_t MTL_TXQ1_UNDERFLOW;                /**< offset: 0xD44 */
  __I  uint32_t MTL_TXQ1_DEBUG;                    /**< offset: 0xD48 */
  uint8_t RESERVED_56[4];
  __IO uint32_t MTL_TXQ1_ETS_CONTROL;              /**< offset: 0xD50 */
  __I  uint32_t MTL_TXQ1_ETS_STATUS;               /**< offset: 0xD54 */
  __IO uint32_t MTL_TXQ1_QUANTUM_WEIGHT;           /**< offset: 0xD58 */
  __IO uint32_t MTL_TXQ1_SENDSLOPECREDIT;          /**< offset: 0xD5C */
  __IO uint32_t MTL_TXQ1_HICREDIT;                 /**< offset: 0xD60 */
  __IO uint32_t MTL_TXQ1_LOCREDIT;                 /**< offset: 0xD64 */
  uint8_t RESERVED_57[4];
  __IO uint32_t MTL_Q1_INTERRUPT_CONTROL_STATUS;   /**< offset: 0xD6C */
  __IO uint32_t MTL_RXQ1_OPERATION_MODE;           /**< offset: 0xD70 */
  __I  uint32_t MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT; /**< offset: 0xD74 */
  __I  uint32_t MTL_RXQ1_DEBUG;                    /**< offset: 0xD78 */
  __IO uint32_t MTL_RXQ1_CONTROL;                  /**< offset: 0xD7C */
  __IO uint32_t MTL_TXQ2_OPERATION_MODE;           /**< offset: 0xD80 */
  __I  uint32_t MTL_TXQ2_UNDERFLOW;                /**< offset: 0xD84 */
  __I  uint32_t MTL_TXQ2_DEBUG;                    /**< offset: 0xD88 */
  uint8_t RESERVED_58[4];
  __IO uint32_t MTL_TXQ2_ETS_CONTROL;              /**< offset: 0xD90 */
  __I  uint32_t MTL_TXQ2_ETS_STATUS;               /**< offset: 0xD94 */
  __IO uint32_t MTL_TXQ2_QUANTUM_WEIGHT;           /**< offset: 0xD98 */
  __IO uint32_t MTL_TXQ2_SENDSLOPECREDIT;          /**< offset: 0xD9C */
  __IO uint32_t MTL_TXQ2_HICREDIT;                 /**< offset: 0xDA0 */
  __IO uint32_t MTL_TXQ2_LOCREDIT;                 /**< offset: 0xDA4 */
  uint8_t RESERVED_59[4];
  __IO uint32_t MTL_Q2_INTERRUPT_CONTROL_STATUS;   /**< offset: 0xDAC */
  __IO uint32_t MTL_RXQ2_OPERATION_MODE;           /**< offset: 0xDB0 */
  __I  uint32_t MTL_RXQ2_MISSED_PACKET_OVERFLOW_CNT; /**< offset: 0xDB4 */
  __I  uint32_t MTL_RXQ2_DEBUG;                    /**< offset: 0xDB8 */
  __IO uint32_t MTL_RXQ2_CONTROL;                  /**< offset: 0xDBC */
  uint8_t RESERVED_60[576];
  __IO uint32_t DMA_MODE;                          /**< offset: 0x1000 */
  __IO uint32_t DMA_SYSBUS_MODE;                   /**< offset: 0x1004 */
  __I  uint32_t DMA_INTERRUPT_STATUS;              /**< offset: 0x1008 */
  __I  uint32_t DMA_DEBUG_STATUS0;                 /**< offset: 0x100C */
  uint8_t RESERVED_61[64];
  __IO uint32_t DMA_TBS_CTRL0;                     /**< offset: 0x1050 */
  __IO uint32_t DMA_TBS_CTRL1;                     /**< offset: 0x1054 */
  __IO uint32_t DMA_TBS_CTRL2;                     /**< offset: 0x1058 */
  __IO uint32_t DMA_TBS_CTRL3;                     /**< offset: 0x105C */
  uint8_t RESERVED_62[32];
  __I  uint32_t DMA_SAFETY_INTERRUPT_STATUS;       /**< offset: 0x1080 */
  uint8_t RESERVED_63[124];
  __IO uint32_t DMA_CH0_CONTROL;                   /**< offset: 0x1100 */
  __IO uint32_t DMA_CH0_TX_CONTROL;                /**< offset: 0x1104 */
  __IO uint32_t DMA_CH0_RX_CONTROL;                /**< offset: 0x1108 */
  uint8_t RESERVED_64[8];
  __IO uint32_t DMA_CH0_TXDESC_LIST_ADDRESS;       /**< offset: 0x1114 */
  uint8_t RESERVED_65[4];
  __IO uint32_t DMA_CH0_RXDESC_LIST_ADDRESS;       /**< offset: 0x111C */
  __IO uint32_t DMA_CH0_TXDESC_TAIL_POINTER;       /**< offset: 0x1120 */
  uint8_t RESERVED_66[4];
  __IO uint32_t DMA_CH0_RXDESC_TAIL_POINTER;       /**< offset: 0x1128 */
  __IO uint32_t DMA_CH0_TXDESC_RING_LENGTH;        /**< offset: 0x112C */
  __IO uint32_t DMA_CH0_RX_CONTROL2;               /**< offset: 0x1130 */
  __IO uint32_t DMA_CH0_INTERRUPT_ENABLE;          /**< offset: 0x1134 */
  __IO uint32_t DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER; /**< offset: 0x1138 */
  __IO uint32_t DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS; /**< offset: 0x113C */
  uint8_t RESERVED_67[4];
  __I  uint32_t DMA_CH0_CURRENT_APP_TXDESC;        /**< offset: 0x1144 */
  uint8_t RESERVED_68[4];
  __I  uint32_t DMA_CH0_CURRENT_APP_RXDESC;        /**< offset: 0x114C */
  uint8_t RESERVED_69[4];
  __I  uint32_t DMA_CH0_CURRENT_APP_TXBUFFER;      /**< offset: 0x1154 */
  uint8_t RESERVED_70[4];
  __I  uint32_t DMA_CH0_CURRENT_APP_RXBUFFER;      /**< offset: 0x115C */
  __IO uint32_t DMA_CH0_STATUS;                    /**< offset: 0x1160 */
  __I  uint32_t DMA_CH0_MISS_FRAME_CNT;            /**< offset: 0x1164 */
  __I  uint32_t DMA_CH0_RXP_ACCEPT_CNT;            /**< offset: 0x1168 */
  __I  uint32_t DMA_CH0_RX_ERI_CNT;                /**< offset: 0x116C */
  uint8_t RESERVED_71[16];
  __IO uint32_t DMA_CH1_CONTROL;                   /**< offset: 0x1180 */
  __IO uint32_t DMA_CH1_TX_CONTROL;                /**< offset: 0x1184 */
  __IO uint32_t DMA_CH1_RX_CONTROL;                /**< offset: 0x1188 */
  uint8_t RESERVED_72[8];
  __IO uint32_t DMA_CH1_TXDESC_LIST_ADDRESS;       /**< offset: 0x1194 */
  uint8_t RESERVED_73[4];
  __IO uint32_t DMA_CH1_RXDESC_LIST_ADDRESS;       /**< offset: 0x119C */
  __IO uint32_t DMA_CH1_TXDESC_TAIL_POINTER;       /**< offset: 0x11A0 */
  uint8_t RESERVED_74[4];
  __IO uint32_t DMA_CH1_RXDESC_TAIL_POINTER;       /**< offset: 0x11A8 */
  __IO uint32_t DMA_CH1_TXDESC_RING_LENGTH;        /**< offset: 0x11AC */
  __IO uint32_t DMA_CH1_RX_CONTROL2;               /**< offset: 0x11B0 */
  __IO uint32_t DMA_CH1_INTERRUPT_ENABLE;          /**< offset: 0x11B4 */
  __IO uint32_t DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER; /**< offset: 0x11B8 */
  __IO uint32_t DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS; /**< offset: 0x11BC */
  uint8_t RESERVED_75[4];
  __I  uint32_t DMA_CH1_CURRENT_APP_TXDESC;        /**< offset: 0x11C4 */
  uint8_t RESERVED_76[4];
  __I  uint32_t DMA_CH1_CURRENT_APP_RXDESC;        /**< offset: 0x11CC */
  uint8_t RESERVED_77[4];
  __I  uint32_t DMA_CH1_CURRENT_APP_TXBUFFER;      /**< offset: 0x11D4 */
  uint8_t RESERVED_78[4];
  __I  uint32_t DMA_CH1_CURRENT_APP_RXBUFFER;      /**< offset: 0x11DC */
  __IO uint32_t DMA_CH1_STATUS;                    /**< offset: 0x11E0 */
  __I  uint32_t DMA_CH1_MISS_FRAME_CNT;            /**< offset: 0x11E4 */
  __I  uint32_t DMA_CH1_RXP_ACCEPT_CNT;            /**< offset: 0x11E8 */
  __I  uint32_t DMA_CH1_RX_ERI_CNT;                /**< offset: 0x11EC */
  uint8_t RESERVED_79[16];
  __IO uint32_t DMA_CH2_CONTROL;                   /**< offset: 0x1200 */
  __IO uint32_t DMA_CH2_TX_CONTROL;                /**< offset: 0x1204 */
  __IO uint32_t DMA_CH2_RX_CONTROL;                /**< offset: 0x1208 */
  uint8_t RESERVED_80[8];
  __IO uint32_t DMA_CH2_TXDESC_LIST_ADDRESS;       /**< offset: 0x1214 */
  uint8_t RESERVED_81[4];
  __IO uint32_t DMA_CH2_RXDESC_LIST_ADDRESS;       /**< offset: 0x121C */
  __IO uint32_t DMA_CH2_TXDESC_TAIL_POINTER;       /**< offset: 0x1220 */
  uint8_t RESERVED_82[4];
  __IO uint32_t DMA_CH2_RXDESC_TAIL_POINTER;       /**< offset: 0x1228 */
  __IO uint32_t DMA_CH2_TXDESC_RING_LENGTH;        /**< offset: 0x122C */
  __IO uint32_t DMA_CH2_RX_CONTROL2;               /**< offset: 0x1230 */
  __IO uint32_t DMA_CH2_INTERRUPT_ENABLE;          /**< offset: 0x1234 */
  __IO uint32_t DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER; /**< offset: 0x1238 */
  __IO uint32_t DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS; /**< offset: 0x123C */
  uint8_t RESERVED_83[4];
  __I  uint32_t DMA_CH2_CURRENT_APP_TXDESC;        /**< offset: 0x1244 */
  uint8_t RESERVED_84[4];
  __I  uint32_t DMA_CH2_CURRENT_APP_RXDESC;        /**< offset: 0x124C */
  uint8_t RESERVED_85[4];
  __I  uint32_t DMA_CH2_CURRENT_APP_TXBUFFER;      /**< offset: 0x1254 */
  uint8_t RESERVED_86[4];
  __I  uint32_t DMA_CH2_CURRENT_APP_RXBUFFER;      /**< offset: 0x125C */
  __IO uint32_t DMA_CH2_STATUS;                    /**< offset: 0x1260 */
  __I  uint32_t DMA_CH2_MISS_FRAME_CNT;            /**< offset: 0x1264 */
  __I  uint32_t DMA_CH2_RXP_ACCEPT_CNT;            /**< offset: 0x1268 */
  __I  uint32_t DMA_CH2_RX_ERI_CNT;                /**< offset: 0x126C */
} GMAC_Type, *GMAC_MemMapPtr;

/** Number of instances of the GMAC module. */
#define GMAC_INSTANCE_COUNT                      (2u)

/* GMAC - Peripheral instance base addresses */
/** Peripheral GMAC_0 base address */
#define IP_GMAC_0_BASE                           (0x40484000u)
/** Peripheral GMAC_0 base pointer */
#define IP_GMAC_0                                ((GMAC_Type *)IP_GMAC_0_BASE)
/** Peripheral GMAC_1 base address */
#define IP_GMAC_1_BASE                           (0x40488000u)
/** Peripheral GMAC_1 base pointer */
#define IP_GMAC_1                                ((GMAC_Type *)IP_GMAC_1_BASE)
/** Array initializer of GMAC peripheral base addresses */
#define IP_GMAC_BASE_ADDRS                       { IP_GMAC_0_BASE, IP_GMAC_1_BASE }
/** Array initializer of GMAC peripheral base pointers */
#define IP_GMAC_BASE_PTRS                        { IP_GMAC_0, IP_GMAC_1 }

/* ----------------------------------------------------------------------------
   -- GMAC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GMAC_Register_Masks GMAC Register Masks
 * @{
 */

