rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name MAC_CONFIGURATION -  */
/*! @{ */

#define GMAC_MAC_CONFIGURATION_RE_MASK           (0x1U)
#define GMAC_MAC_CONFIGURATION_RE_SHIFT          (0U)
#define GMAC_MAC_CONFIGURATION_RE_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_RE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_RE_SHIFT)) & GMAC_MAC_CONFIGURATION_RE_MASK)

#define GMAC_MAC_CONFIGURATION_TE_MASK           (0x2U)
#define GMAC_MAC_CONFIGURATION_TE_SHIFT          (1U)
#define GMAC_MAC_CONFIGURATION_TE_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_TE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_TE_SHIFT)) & GMAC_MAC_CONFIGURATION_TE_MASK)

#define GMAC_MAC_CONFIGURATION_PRELEN_MASK       (0xCU)
#define GMAC_MAC_CONFIGURATION_PRELEN_SHIFT      (2U)
#define GMAC_MAC_CONFIGURATION_PRELEN_WIDTH      (2U)
#define GMAC_MAC_CONFIGURATION_PRELEN(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_PRELEN_SHIFT)) & GMAC_MAC_CONFIGURATION_PRELEN_MASK)

#define GMAC_MAC_CONFIGURATION_DC_MASK           (0x10U)
#define GMAC_MAC_CONFIGURATION_DC_SHIFT          (4U)
#define GMAC_MAC_CONFIGURATION_DC_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_DC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_DC_SHIFT)) & GMAC_MAC_CONFIGURATION_DC_MASK)

#define GMAC_MAC_CONFIGURATION_BL_MASK           (0x60U)
#define GMAC_MAC_CONFIGURATION_BL_SHIFT          (5U)
#define GMAC_MAC_CONFIGURATION_BL_WIDTH          (2U)
#define GMAC_MAC_CONFIGURATION_BL(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_BL_SHIFT)) & GMAC_MAC_CONFIGURATION_BL_MASK)

#define GMAC_MAC_CONFIGURATION_Reserved_7_MASK   (0x80U)
#define GMAC_MAC_CONFIGURATION_Reserved_7_SHIFT  (7U)
#define GMAC_MAC_CONFIGURATION_Reserved_7_WIDTH  (1U)
#define GMAC_MAC_CONFIGURATION_Reserved_7(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_Reserved_7_SHIFT)) & GMAC_MAC_CONFIGURATION_Reserved_7_MASK)

#define GMAC_MAC_CONFIGURATION_DR_MASK           (0x100U)
#define GMAC_MAC_CONFIGURATION_DR_SHIFT          (8U)
#define GMAC_MAC_CONFIGURATION_DR_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_DR(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_DR_SHIFT)) & GMAC_MAC_CONFIGURATION_DR_MASK)

#define GMAC_MAC_CONFIGURATION_DCRS_MASK         (0x200U)
#define GMAC_MAC_CONFIGURATION_DCRS_SHIFT        (9U)
#define GMAC_MAC_CONFIGURATION_DCRS_WIDTH        (1U)
#define GMAC_MAC_CONFIGURATION_DCRS(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_DCRS_SHIFT)) & GMAC_MAC_CONFIGURATION_DCRS_MASK)

#define GMAC_MAC_CONFIGURATION_DO_MASK           (0x400U)
#define GMAC_MAC_CONFIGURATION_DO_SHIFT          (10U)
#define GMAC_MAC_CONFIGURATION_DO_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_DO(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_DO_SHIFT)) & GMAC_MAC_CONFIGURATION_DO_MASK)

#define GMAC_MAC_CONFIGURATION_ECRSFD_MASK       (0x800U)
#define GMAC_MAC_CONFIGURATION_ECRSFD_SHIFT      (11U)
#define GMAC_MAC_CONFIGURATION_ECRSFD_WIDTH      (1U)
#define GMAC_MAC_CONFIGURATION_ECRSFD(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_ECRSFD_SHIFT)) & GMAC_MAC_CONFIGURATION_ECRSFD_MASK)

#define GMAC_MAC_CONFIGURATION_LM_MASK           (0x1000U)
#define GMAC_MAC_CONFIGURATION_LM_SHIFT          (12U)
#define GMAC_MAC_CONFIGURATION_LM_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_LM(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_LM_SHIFT)) & GMAC_MAC_CONFIGURATION_LM_MASK)

#define GMAC_MAC_CONFIGURATION_DM_MASK           (0x2000U)
#define GMAC_MAC_CONFIGURATION_DM_SHIFT          (13U)
#define GMAC_MAC_CONFIGURATION_DM_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_DM(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_DM_SHIFT)) & GMAC_MAC_CONFIGURATION_DM_MASK)

#define GMAC_MAC_CONFIGURATION_FES_MASK          (0x4000U)
#define GMAC_MAC_CONFIGURATION_FES_SHIFT         (14U)
#define GMAC_MAC_CONFIGURATION_FES_WIDTH         (1U)
#define GMAC_MAC_CONFIGURATION_FES(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_FES_SHIFT)) & GMAC_MAC_CONFIGURATION_FES_MASK)

#define GMAC_MAC_CONFIGURATION_PS_MASK           (0x8000U)
#define GMAC_MAC_CONFIGURATION_PS_SHIFT          (15U)
#define GMAC_MAC_CONFIGURATION_PS_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_PS(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_PS_SHIFT)) & GMAC_MAC_CONFIGURATION_PS_MASK)

#define GMAC_MAC_CONFIGURATION_JE_MASK           (0x10000U)
#define GMAC_MAC_CONFIGURATION_JE_SHIFT          (16U)
#define GMAC_MAC_CONFIGURATION_JE_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_JE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_JE_SHIFT)) & GMAC_MAC_CONFIGURATION_JE_MASK)

#define GMAC_MAC_CONFIGURATION_JD_MASK           (0x20000U)
#define GMAC_MAC_CONFIGURATION_JD_SHIFT          (17U)
#define GMAC_MAC_CONFIGURATION_JD_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_JD(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_JD_SHIFT)) & GMAC_MAC_CONFIGURATION_JD_MASK)

#define GMAC_MAC_CONFIGURATION_BE_MASK           (0x40000U)
#define GMAC_MAC_CONFIGURATION_BE_SHIFT          (18U)
#define GMAC_MAC_CONFIGURATION_BE_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_BE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_BE_SHIFT)) & GMAC_MAC_CONFIGURATION_BE_MASK)

#define GMAC_MAC_CONFIGURATION_WD_MASK           (0x80000U)
#define GMAC_MAC_CONFIGURATION_WD_SHIFT          (19U)
#define GMAC_MAC_CONFIGURATION_WD_WIDTH          (1U)
#define GMAC_MAC_CONFIGURATION_WD(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_WD_SHIFT)) & GMAC_MAC_CONFIGURATION_WD_MASK)

#define GMAC_MAC_CONFIGURATION_ACS_MASK          (0x100000U)
#define GMAC_MAC_CONFIGURATION_ACS_SHIFT         (20U)
#define GMAC_MAC_CONFIGURATION_ACS_WIDTH         (1U)
#define GMAC_MAC_CONFIGURATION_ACS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_ACS_SHIFT)) & GMAC_MAC_CONFIGURATION_ACS_MASK)

#define GMAC_MAC_CONFIGURATION_CST_MASK          (0x200000U)
#define GMAC_MAC_CONFIGURATION_CST_SHIFT         (21U)
#define GMAC_MAC_CONFIGURATION_CST_WIDTH         (1U)
#define GMAC_MAC_CONFIGURATION_CST(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_CST_SHIFT)) & GMAC_MAC_CONFIGURATION_CST_MASK)

