rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_PACKET_FILTER_PR_MASK           (0x1U)
#define GMAC_MAC_PACKET_FILTER_PR_SHIFT          (0U)
#define GMAC_MAC_PACKET_FILTER_PR_WIDTH          (1U)
#define GMAC_MAC_PACKET_FILTER_PR(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_PR_SHIFT)) & GMAC_MAC_PACKET_FILTER_PR_MASK)

#define GMAC_MAC_PACKET_FILTER_HUC_MASK          (0x2U)
#define GMAC_MAC_PACKET_FILTER_HUC_SHIFT         (1U)
#define GMAC_MAC_PACKET_FILTER_HUC_WIDTH         (1U)
#define GMAC_MAC_PACKET_FILTER_HUC(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_HUC_SHIFT)) & GMAC_MAC_PACKET_FILTER_HUC_MASK)

#define GMAC_MAC_PACKET_FILTER_HMC_MASK          (0x4U)
#define GMAC_MAC_PACKET_FILTER_HMC_SHIFT         (2U)
#define GMAC_MAC_PACKET_FILTER_HMC_WIDTH         (1U)
#define GMAC_MAC_PACKET_FILTER_HMC(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_HMC_SHIFT)) & GMAC_MAC_PACKET_FILTER_HMC_MASK)

#define GMAC_MAC_PACKET_FILTER_DAIF_MASK         (0x8U)
#define GMAC_MAC_PACKET_FILTER_DAIF_SHIFT        (3U)
#define GMAC_MAC_PACKET_FILTER_DAIF_WIDTH        (1U)
#define GMAC_MAC_PACKET_FILTER_DAIF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_DAIF_SHIFT)) & GMAC_MAC_PACKET_FILTER_DAIF_MASK)

#define GMAC_MAC_PACKET_FILTER_PM_MASK           (0x10U)
#define GMAC_MAC_PACKET_FILTER_PM_SHIFT          (4U)
#define GMAC_MAC_PACKET_FILTER_PM_WIDTH          (1U)
#define GMAC_MAC_PACKET_FILTER_PM(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_PM_SHIFT)) & GMAC_MAC_PACKET_FILTER_PM_MASK)

#define GMAC_MAC_PACKET_FILTER_DBF_MASK          (0x20U)
#define GMAC_MAC_PACKET_FILTER_DBF_SHIFT         (5U)
#define GMAC_MAC_PACKET_FILTER_DBF_WIDTH         (1U)
#define GMAC_MAC_PACKET_FILTER_DBF(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_DBF_SHIFT)) & GMAC_MAC_PACKET_FILTER_DBF_MASK)

#define GMAC_MAC_PACKET_FILTER_PCF_MASK          (0xC0U)
#define GMAC_MAC_PACKET_FILTER_PCF_SHIFT         (6U)
#define GMAC_MAC_PACKET_FILTER_PCF_WIDTH         (2U)
#define GMAC_MAC_PACKET_FILTER_PCF(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_PCF_SHIFT)) & GMAC_MAC_PACKET_FILTER_PCF_MASK)

#define GMAC_MAC_PACKET_FILTER_SAIF_MASK         (0x100U)
#define GMAC_MAC_PACKET_FILTER_SAIF_SHIFT        (8U)
#define GMAC_MAC_PACKET_FILTER_SAIF_WIDTH        (1U)
#define GMAC_MAC_PACKET_FILTER_SAIF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_SAIF_SHIFT)) & GMAC_MAC_PACKET_FILTER_SAIF_MASK)

#define GMAC_MAC_PACKET_FILTER_SAF_MASK          (0x200U)
#define GMAC_MAC_PACKET_FILTER_SAF_SHIFT         (9U)
#define GMAC_MAC_PACKET_FILTER_SAF_WIDTH         (1U)
#define GMAC_MAC_PACKET_FILTER_SAF(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_SAF_SHIFT)) & GMAC_MAC_PACKET_FILTER_SAF_MASK)

#define GMAC_MAC_PACKET_FILTER_HPF_MASK          (0x400U)
#define GMAC_MAC_PACKET_FILTER_HPF_SHIFT         (10U)
#define GMAC_MAC_PACKET_FILTER_HPF_WIDTH         (1U)
#define GMAC_MAC_PACKET_FILTER_HPF(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_HPF_SHIFT)) & GMAC_MAC_PACKET_FILTER_HPF_MASK)

#define GMAC_MAC_PACKET_FILTER_Reserved_15_11_MASK (0xF800U)
#define GMAC_MAC_PACKET_FILTER_Reserved_15_11_SHIFT (11U)
#define GMAC_MAC_PACKET_FILTER_Reserved_15_11_WIDTH (5U)
#define GMAC_MAC_PACKET_FILTER_Reserved_15_11(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_Reserved_15_11_SHIFT)) & GMAC_MAC_PACKET_FILTER_Reserved_15_11_MASK)

#define GMAC_MAC_PACKET_FILTER_VTFE_MASK         (0x10000U)
#define GMAC_MAC_PACKET_FILTER_VTFE_SHIFT        (16U)
#define GMAC_MAC_PACKET_FILTER_VTFE_WIDTH        (1U)
#define GMAC_MAC_PACKET_FILTER_VTFE(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_VTFE_SHIFT)) & GMAC_MAC_PACKET_FILTER_VTFE_MASK)

#define GMAC_MAC_PACKET_FILTER_Reserved_19_17_MASK (0xE0000U)
#define GMAC_MAC_PACKET_FILTER_Reserved_19_17_SHIFT (17U)
#define GMAC_MAC_PACKET_FILTER_Reserved_19_17_WIDTH (3U)
#define GMAC_MAC_PACKET_FILTER_Reserved_19_17(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_Reserved_19_17_SHIFT)) & GMAC_MAC_PACKET_FILTER_Reserved_19_17_MASK)

#define GMAC_MAC_PACKET_FILTER_IPFE_MASK         (0x100000U)
#define GMAC_MAC_PACKET_FILTER_IPFE_SHIFT        (20U)
#define GMAC_MAC_PACKET_FILTER_IPFE_WIDTH        (1U)
#define GMAC_MAC_PACKET_FILTER_IPFE(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_IPFE_SHIFT)) & GMAC_MAC_PACKET_FILTER_IPFE_MASK)

#define GMAC_MAC_PACKET_FILTER_DNTU_MASK         (0x200000U)
#define GMAC_MAC_PACKET_FILTER_DNTU_SHIFT        (21U)
#define GMAC_MAC_PACKET_FILTER_DNTU_WIDTH        (1U)
#define GMAC_MAC_PACKET_FILTER_DNTU(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_DNTU_SHIFT)) & GMAC_MAC_PACKET_FILTER_DNTU_MASK)

#define GMAC_MAC_PACKET_FILTER_Reserved_30_22_MASK (0x7FC00000U)
#define GMAC_MAC_PACKET_FILTER_Reserved_30_22_SHIFT (22U)
#define GMAC_MAC_PACKET_FILTER_Reserved_30_22_WIDTH (9U)
#define GMAC_MAC_PACKET_FILTER_Reserved_30_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_Reserved_30_22_SHIFT)) & GMAC_MAC_PACKET_FILTER_Reserved_30_22_MASK)

#define GMAC_MAC_PACKET_FILTER_RA_MASK           (0x80000000U)
#define GMAC_MAC_PACKET_FILTER_RA_SHIFT          (31U)
#define GMAC_MAC_PACKET_FILTER_RA_WIDTH          (1U)
#define GMAC_MAC_PACKET_FILTER_RA(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PACKET_FILTER_RA_SHIFT)) & GMAC_MAC_PACKET_FILTER_RA_MASK)
/*! @} */

/*! @name MAC_WATCHDOG_TIMEOUT -  */
/*! @{ */

#define GMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK       (0xFU)
#define GMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT      (0U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_WTO_WIDTH      (4U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_WTO(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT)) & GMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK)

#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4_MASK (0xF0U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4_SHIFT (4U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4_WIDTH (4U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4_SHIFT)) & GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_7_4_MASK)

#define GMAC_MAC_WATCHDOG_TIMEOUT_PWE_MASK       (0x100U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_PWE_SHIFT      (8U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_PWE_WIDTH      (1U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_PWE(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_WATCHDOG_TIMEOUT_PWE_SHIFT)) & GMAC_MAC_WATCHDOG_TIMEOUT_PWE_MASK)

#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9_MASK (0xFFFFFE00U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9_SHIFT (9U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9_WIDTH (23U)
#define GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9_SHIFT)) & GMAC_MAC_WATCHDOG_TIMEOUT_Reserved_31_9_MASK)
/*! @} */

