rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER1_VID_MASK       (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT      (0U)
#define GMAC_MAC_VLAN_TAG_FILTER1_VID_WIDTH      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER1_VID(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_VEN_MASK       (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_VEN_SHIFT      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER1_VEN_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_VEN(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_ETV_MASK       (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ETV_SHIFT      (17U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ETV_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ETV(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_MASK    (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_SHIFT   (18U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_MASK    (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_SHIFT   (19U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_MASK    (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_SHIFT   (20U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_MASK   (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_SHIFT  (24U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHN_MASK    (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHN_SHIFT   (25U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHN_WIDTH   (2U)
#define GMAC_MAC_VLAN_TAG_FILTER1_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER1_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER2 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER2_VID_MASK       (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT      (0U)
#define GMAC_MAC_VLAN_TAG_FILTER2_VID_WIDTH      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER2_VID(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_VEN_MASK       (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_VEN_SHIFT      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER2_VEN_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_VEN(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_ETV_MASK       (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ETV_SHIFT      (17U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ETV_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ETV(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_MASK    (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_SHIFT   (18U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_MASK    (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_SHIFT   (19U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_MASK    (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_SHIFT   (20U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_MASK   (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_SHIFT  (24U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHN_MASK    (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHN_SHIFT   (25U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHN_WIDTH   (2U)
#define GMAC_MAC_VLAN_TAG_FILTER2_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER2_Reserved_31_y_MASK)
/*! @} */

