rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER19_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER19_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER19_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER19_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER19_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER19_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER20 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER20_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER20_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER20_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER20_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER20_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER20_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER20_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER21 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER21_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER21_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER21_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER21_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER21_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_ERSVLM_MASK)

