rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER24 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER24_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER24_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER24_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER24_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER24_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER24_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER24_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER25 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER25_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER25_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER25_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER25_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER25_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER25_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER25_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER26 -  */
/*! @{ */

