rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER28 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER28_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER28_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER28_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER28_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER28_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER28_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER28_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER29 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER29_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER29_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER29_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER29_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER29_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER29_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER29_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER30 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER30_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER30_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER30_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER30_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER30_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_ERSVLM_MASK)

