rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_VLAN_INCL2_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL2_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL2_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL2_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL2_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL2_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL2_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL2_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL2_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL2_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL2_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL2_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL3 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL3_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL3_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL3_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL3_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL3_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL3_VLT_MASK)

#define GMAC_MAC_VLAN_INCL3_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL3_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL3_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL3_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL3_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL3_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL3_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL3_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL3_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL3_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL3_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL3_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL3_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL3_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL3_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL3_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL3_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL3_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL4 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL4_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL4_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL4_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL4_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL4_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL4_VLT_MASK)

#define GMAC_MAC_VLAN_INCL4_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL4_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL4_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL4_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL4_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL4_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL4_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL4_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL4_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL4_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL4_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL4_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL4_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL4_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL4_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL4_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL4_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL4_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL5 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL5_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL5_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL5_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL5_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL5_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL5_VLT_MASK)

#define GMAC_MAC_VLAN_INCL5_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL5_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL5_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL5_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL5_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL5_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL5_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL5_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL5_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL5_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL5_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL5_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL5_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL5_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL5_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL5_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL5_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL5_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL6 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL6_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL6_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL6_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL6_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL6_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL6_VLT_MASK)

#define GMAC_MAC_VLAN_INCL6_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL6_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL6_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL6_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL6_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL6_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL6_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL6_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL6_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL6_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL6_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL6_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL6_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL6_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL6_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL6_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL6_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL6_Reserved_31_20_MASK)
/*! @} */

