rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_RXQ_CTRL4_Reserved_7_y_MASK     (0xF8U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_7_y_SHIFT    (3U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_7_y_WIDTH    (5U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_7_y(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_Reserved_7_y_SHIFT)) & GMAC_MAC_RXQ_CTRL4_Reserved_7_y_MASK)

#define GMAC_MAC_RXQ_CTRL4_MFFQE_MASK            (0x100U)
#define GMAC_MAC_RXQ_CTRL4_MFFQE_SHIFT           (8U)
#define GMAC_MAC_RXQ_CTRL4_MFFQE_WIDTH           (1U)
#define GMAC_MAC_RXQ_CTRL4_MFFQE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_MFFQE_SHIFT)) & GMAC_MAC_RXQ_CTRL4_MFFQE_MASK)

#define GMAC_MAC_RXQ_CTRL4_MFFQ_MASK             (0x600U)
#define GMAC_MAC_RXQ_CTRL4_MFFQ_SHIFT            (9U)
#define GMAC_MAC_RXQ_CTRL4_MFFQ_WIDTH            (2U)
#define GMAC_MAC_RXQ_CTRL4_MFFQ(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_MFFQ_SHIFT)) & GMAC_MAC_RXQ_CTRL4_MFFQ_MASK)

#define GMAC_MAC_RXQ_CTRL4_Reserved_15_y_MASK    (0xF800U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_15_y_SHIFT   (11U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_15_y_WIDTH   (5U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_15_y(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_Reserved_15_y_SHIFT)) & GMAC_MAC_RXQ_CTRL4_Reserved_15_y_MASK)

#define GMAC_MAC_RXQ_CTRL4_VFFQE_MASK            (0x10000U)
#define GMAC_MAC_RXQ_CTRL4_VFFQE_SHIFT           (16U)
#define GMAC_MAC_RXQ_CTRL4_VFFQE_WIDTH           (1U)
#define GMAC_MAC_RXQ_CTRL4_VFFQE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_VFFQE_SHIFT)) & GMAC_MAC_RXQ_CTRL4_VFFQE_MASK)

#define GMAC_MAC_RXQ_CTRL4_VFFQ_MASK             (0x60000U)
#define GMAC_MAC_RXQ_CTRL4_VFFQ_SHIFT            (17U)
#define GMAC_MAC_RXQ_CTRL4_VFFQ_WIDTH            (2U)
#define GMAC_MAC_RXQ_CTRL4_VFFQ(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_VFFQ_SHIFT)) & GMAC_MAC_RXQ_CTRL4_VFFQ_MASK)

#define GMAC_MAC_RXQ_CTRL4_Reserved_31_y_MASK    (0xFFF80000U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_31_y_SHIFT   (19U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_31_y_WIDTH   (13U)
#define GMAC_MAC_RXQ_CTRL4_Reserved_31_y(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_Reserved_31_y_SHIFT)) & GMAC_MAC_RXQ_CTRL4_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_TXQ_PRTY_MAP0 -  */
/*! @{ */

#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0_MASK        (0xFFU)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0_SHIFT       (0U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0_WIDTH       (8U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0_SHIFT)) & GMAC_MAC_TXQ_PRTY_MAP0_PSTQ0_MASK)

#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1_MASK        (0xFF00U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1_SHIFT       (8U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1_WIDTH       (8U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1_SHIFT)) & GMAC_MAC_TXQ_PRTY_MAP0_PSTQ1_MASK)

#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2_MASK        (0xFF0000U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2_SHIFT       (16U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2_WIDTH       (8U)
#define GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2_SHIFT)) & GMAC_MAC_TXQ_PRTY_MAP0_PSTQ2_MASK)

#define GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3_MASK (0xFF000000U)
#define GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3_SHIFT (24U)
#define GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3_WIDTH (8U)
#define GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3_SHIFT)) & GMAC_MAC_TXQ_PRTY_MAP0_Reserved_PSTQ3_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL0 -  */
/*! @{ */

#define GMAC_MAC_RXQ_CTRL0_RXQ0EN_MASK           (0x3U)
#define GMAC_MAC_RXQ_CTRL0_RXQ0EN_SHIFT          (0U)
#define GMAC_MAC_RXQ_CTRL0_RXQ0EN_WIDTH          (2U)
#define GMAC_MAC_RXQ_CTRL0_RXQ0EN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_RXQ0EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_RXQ0EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_RXQ1EN_MASK           (0xCU)
#define GMAC_MAC_RXQ_CTRL0_RXQ1EN_SHIFT          (2U)
#define GMAC_MAC_RXQ_CTRL0_RXQ1EN_WIDTH          (2U)
#define GMAC_MAC_RXQ_CTRL0_RXQ1EN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_RXQ1EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_RXQ1EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_RXQ2EN_MASK           (0x30U)
#define GMAC_MAC_RXQ_CTRL0_RXQ2EN_SHIFT          (4U)
#define GMAC_MAC_RXQ_CTRL0_RXQ2EN_WIDTH          (2U)
#define GMAC_MAC_RXQ_CTRL0_RXQ2EN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_RXQ2EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_RXQ2EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN_MASK  (0xC0U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN_SHIFT (6U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN_WIDTH (2U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_RXQ3EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN_MASK  (0x300U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN_SHIFT (8U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN_WIDTH (2U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_RXQ4EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN_MASK  (0xC00U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN_SHIFT (10U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN_WIDTH (2U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_RXQ5EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN_MASK  (0x3000U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN_SHIFT (12U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN_WIDTH (2U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_RXQ6EN_MASK)

#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN_MASK  (0xC000U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN_SHIFT (14U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN_WIDTH (2U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_RXQ7EN_MASK)

