rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_RXQ_CTRL0_Reserved_31_16_MASK   (0xFFFF0000U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_31_16_SHIFT  (16U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_31_16_WIDTH  (16U)
#define GMAC_MAC_RXQ_CTRL0_Reserved_31_16(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL0_Reserved_31_16_SHIFT)) & GMAC_MAC_RXQ_CTRL0_Reserved_31_16_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL1 -  */
/*! @{ */

#define GMAC_MAC_RXQ_CTRL1_AVCPQ_MASK            (0x7U)
#define GMAC_MAC_RXQ_CTRL1_AVCPQ_SHIFT           (0U)
#define GMAC_MAC_RXQ_CTRL1_AVCPQ_WIDTH           (3U)
#define GMAC_MAC_RXQ_CTRL1_AVCPQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_AVCPQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_AVCPQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_3_MASK       (0x8U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_3_SHIFT      (3U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_3_WIDTH      (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_3(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_3_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_3_MASK)

#define GMAC_MAC_RXQ_CTRL1_PTPQ_MASK             (0x70U)
#define GMAC_MAC_RXQ_CTRL1_PTPQ_SHIFT            (4U)
#define GMAC_MAC_RXQ_CTRL1_PTPQ_WIDTH            (3U)
#define GMAC_MAC_RXQ_CTRL1_PTPQ(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_PTPQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_PTPQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_7_MASK       (0x80U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_7_SHIFT      (7U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_7_WIDTH      (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_7(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_7_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_7_MASK)

#define GMAC_MAC_RXQ_CTRL1_DCBCPQ_MASK           (0x700U)
#define GMAC_MAC_RXQ_CTRL1_DCBCPQ_SHIFT          (8U)
#define GMAC_MAC_RXQ_CTRL1_DCBCPQ_WIDTH          (3U)
#define GMAC_MAC_RXQ_CTRL1_DCBCPQ(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_DCBCPQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_DCBCPQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_11_MASK      (0x800U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_11_SHIFT     (11U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_11_WIDTH     (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_11(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_11_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_11_MASK)

#define GMAC_MAC_RXQ_CTRL1_UPQ_MASK              (0x7000U)
#define GMAC_MAC_RXQ_CTRL1_UPQ_SHIFT             (12U)
#define GMAC_MAC_RXQ_CTRL1_UPQ_WIDTH             (3U)
#define GMAC_MAC_RXQ_CTRL1_UPQ(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_UPQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_UPQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_15_MASK      (0x8000U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_15_SHIFT     (15U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_15_WIDTH     (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_15(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_15_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_15_MASK)

#define GMAC_MAC_RXQ_CTRL1_MCBCQ_MASK            (0x70000U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQ_SHIFT           (16U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQ_WIDTH           (3U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_MCBCQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_MCBCQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_19_MASK      (0x80000U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_19_SHIFT     (19U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_19_WIDTH     (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_19(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_19_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_19_MASK)

#define GMAC_MAC_RXQ_CTRL1_MCBCQEN_MASK          (0x100000U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQEN_SHIFT         (20U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQEN_WIDTH         (1U)
#define GMAC_MAC_RXQ_CTRL1_MCBCQEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_MCBCQEN_SHIFT)) & GMAC_MAC_RXQ_CTRL1_MCBCQEN_MASK)

#define GMAC_MAC_RXQ_CTRL1_TACPQE_MASK           (0x200000U)
#define GMAC_MAC_RXQ_CTRL1_TACPQE_SHIFT          (21U)
#define GMAC_MAC_RXQ_CTRL1_TACPQE_WIDTH          (1U)
#define GMAC_MAC_RXQ_CTRL1_TACPQE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_TACPQE_SHIFT)) & GMAC_MAC_RXQ_CTRL1_TACPQE_MASK)

#define GMAC_MAC_RXQ_CTRL1_TPQC_MASK             (0xC00000U)
#define GMAC_MAC_RXQ_CTRL1_TPQC_SHIFT            (22U)
#define GMAC_MAC_RXQ_CTRL1_TPQC_WIDTH            (2U)
#define GMAC_MAC_RXQ_CTRL1_TPQC(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_TPQC_SHIFT)) & GMAC_MAC_RXQ_CTRL1_TPQC_MASK)

#define GMAC_MAC_RXQ_CTRL1_FPRQ_MASK             (0x7000000U)
#define GMAC_MAC_RXQ_CTRL1_FPRQ_SHIFT            (24U)
#define GMAC_MAC_RXQ_CTRL1_FPRQ_WIDTH            (3U)
#define GMAC_MAC_RXQ_CTRL1_FPRQ(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_FPRQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_FPRQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_27_MASK      (0x8000000U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_27_SHIFT     (27U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_27_WIDTH     (1U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_27(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_27_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_27_MASK)

#define GMAC_MAC_RXQ_CTRL1_OMCBCQ_MASK           (0x10000000U)
#define GMAC_MAC_RXQ_CTRL1_OMCBCQ_SHIFT          (28U)
#define GMAC_MAC_RXQ_CTRL1_OMCBCQ_WIDTH          (1U)
#define GMAC_MAC_RXQ_CTRL1_OMCBCQ(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_OMCBCQ_SHIFT)) & GMAC_MAC_RXQ_CTRL1_OMCBCQ_MASK)

#define GMAC_MAC_RXQ_CTRL1_TBRQE_MASK            (0x20000000U)
#define GMAC_MAC_RXQ_CTRL1_TBRQE_SHIFT           (29U)
#define GMAC_MAC_RXQ_CTRL1_TBRQE_WIDTH           (1U)
#define GMAC_MAC_RXQ_CTRL1_TBRQE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_TBRQE_SHIFT)) & GMAC_MAC_RXQ_CTRL1_TBRQE_MASK)

#define GMAC_MAC_RXQ_CTRL1_Reserved_31_30_MASK   (0xC0000000U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_31_30_SHIFT  (30U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_31_30_WIDTH  (2U)
#define GMAC_MAC_RXQ_CTRL1_Reserved_31_30(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL1_Reserved_31_30_SHIFT)) & GMAC_MAC_RXQ_CTRL1_Reserved_31_30_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL2 -  */
/*! @{ */

#define GMAC_MAC_RXQ_CTRL2_PSRQ0_MASK            (0xFFU)
#define GMAC_MAC_RXQ_CTRL2_PSRQ0_SHIFT           (0U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ0_WIDTH           (8U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ0(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL2_PSRQ0_SHIFT)) & GMAC_MAC_RXQ_CTRL2_PSRQ0_MASK)

