rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_RXQ_CTRL2_PSRQ1_MASK            (0xFF00U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ1_SHIFT           (8U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ1_WIDTH           (8U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ1(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL2_PSRQ1_SHIFT)) & GMAC_MAC_RXQ_CTRL2_PSRQ1_MASK)

#define GMAC_MAC_RXQ_CTRL2_PSRQ2_MASK            (0xFF0000U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ2_SHIFT           (16U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ2_WIDTH           (8U)
#define GMAC_MAC_RXQ_CTRL2_PSRQ2(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL2_PSRQ2_SHIFT)) & GMAC_MAC_RXQ_CTRL2_PSRQ2_MASK)

#define GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3_MASK   (0xFF000000U)
#define GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3_SHIFT  (24U)
#define GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3_WIDTH  (8U)
#define GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3_SHIFT)) & GMAC_MAC_RXQ_CTRL2_Reserved_PSRQ3_MASK)
/*! @} */

/*! @name MAC_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS_MASK  (0x1U)
#define GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS_SHIFT (0U)
#define GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_RGSMIIIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS_MASK (0x2U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS_SHIFT (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSLCHGIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS_MASK (0x4U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS_SHIFT (2U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_PCSANCIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_PHYIS_MASK     (0x8U)
#define GMAC_MAC_INTERRUPT_STATUS_PHYIS_SHIFT    (3U)
#define GMAC_MAC_INTERRUPT_STATUS_PHYIS_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_STATUS_PHYIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_PHYIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_PHYIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS_MASK (0x10U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS_SHIFT (4U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_PMTIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS_MASK (0x20U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS_SHIFT (5U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_LPIIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6_MASK (0xC0U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6_SHIFT (6U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6_WIDTH (2U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_7_6_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MMCIS_MASK     (0x100U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCIS_SHIFT    (8U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCIS_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MMCIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MMCIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MMCRXIS_MASK   (0x200U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCRXIS_SHIFT  (9U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCRXIS_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCRXIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MMCRXIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MMCRXIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MMCTXIS_MASK   (0x400U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCTXIS_SHIFT  (10U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCTXIS_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MMCTXIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MMCTXIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MMCTXIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS_MASK (0x800U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS_SHIFT (11U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_MMCRXIPIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_TSIS_MASK      (0x1000U)
#define GMAC_MAC_INTERRUPT_STATUS_TSIS_SHIFT     (12U)
#define GMAC_MAC_INTERRUPT_STATUS_TSIS_WIDTH     (1U)
#define GMAC_MAC_INTERRUPT_STATUS_TSIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_TSIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_TSIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_TXSTSIS_MASK   (0x2000U)
#define GMAC_MAC_INTERRUPT_STATUS_TXSTSIS_SHIFT  (13U)
#define GMAC_MAC_INTERRUPT_STATUS_TXSTSIS_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_STATUS_TXSTSIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_TXSTSIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_TXSTSIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_RXSTSIS_MASK   (0x4000U)
#define GMAC_MAC_INTERRUPT_STATUS_RXSTSIS_SHIFT  (14U)
#define GMAC_MAC_INTERRUPT_STATUS_RXSTSIS_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_STATUS_RXSTSIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_RXSTSIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_RXSTSIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS_MASK (0x8000U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS_SHIFT (15U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_GPIIS_MASK)

