rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_16_MASK (0x10000U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_16_SHIFT (16U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_16_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_16_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_16_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_FPEIS_MASK     (0x20000U)
#define GMAC_MAC_INTERRUPT_STATUS_FPEIS_SHIFT    (17U)
#define GMAC_MAC_INTERRUPT_STATUS_FPEIS_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_STATUS_FPEIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_FPEIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_FPEIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MDIOIS_MASK    (0x40000U)
#define GMAC_MAC_INTERRUPT_STATUS_MDIOIS_SHIFT   (18U)
#define GMAC_MAC_INTERRUPT_STATUS_MDIOIS_WIDTH   (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MDIOIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MDIOIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MDIOIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MFTIS_MASK     (0x80000U)
#define GMAC_MAC_INTERRUPT_STATUS_MFTIS_SHIFT    (19U)
#define GMAC_MAC_INTERRUPT_STATUS_MFTIS_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MFTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MFTIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MFTIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_MFRIS_MASK     (0x100000U)
#define GMAC_MAC_INTERRUPT_STATUS_MFRIS_SHIFT    (20U)
#define GMAC_MAC_INTERRUPT_STATUS_MFRIS_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_STATUS_MFRIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_MFRIS_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_MFRIS_MASK)

#define GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21_MASK (0xFFE00000U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21_SHIFT)) & GMAC_MAC_INTERRUPT_STATUS_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_INTERRUPT_ENABLE -  */
/*! @{ */

#define GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE_MASK  (0x1U)
#define GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE_SHIFT (0U)
#define GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_RGSMIIIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE_MASK (0x2U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE_SHIFT (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSLCHGIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE_MASK (0x4U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE_SHIFT (2U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_PCSANCIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_PHYIE_MASK     (0x8U)
#define GMAC_MAC_INTERRUPT_ENABLE_PHYIE_SHIFT    (3U)
#define GMAC_MAC_INTERRUPT_ENABLE_PHYIE_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_PHYIE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_PHYIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_PHYIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE_MASK (0x10U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE_SHIFT (4U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_PMTIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE_MASK (0x20U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE_SHIFT (5U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_LPIIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6_MASK (0xFC0U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6_SHIFT (6U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6_WIDTH (6U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_11_6_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_TSIE_MASK      (0x1000U)
#define GMAC_MAC_INTERRUPT_ENABLE_TSIE_SHIFT     (12U)
#define GMAC_MAC_INTERRUPT_ENABLE_TSIE_WIDTH     (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_TSIE(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_TSIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_TSIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_MASK   (0x2000U)
#define GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_SHIFT  (13U)
#define GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_MASK   (0x4000U)
#define GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_SHIFT  (14U)
#define GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_WIDTH  (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_15_MASK (0x8000U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_15_SHIFT (15U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_15_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_15(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_15_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_15_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_16_MASK (0x10000U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_16_SHIFT (16U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_16_WIDTH (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_16_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_16_MASK)

