rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_INTERRUPT_ENABLE_FPEIE_MASK     (0x20000U)
#define GMAC_MAC_INTERRUPT_ENABLE_FPEIE_SHIFT    (17U)
#define GMAC_MAC_INTERRUPT_ENABLE_FPEIE_WIDTH    (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_FPEIE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_FPEIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_FPEIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_MDIOIE_MASK    (0x40000U)
#define GMAC_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT   (18U)
#define GMAC_MAC_INTERRUPT_ENABLE_MDIOIE_WIDTH   (1U)
#define GMAC_MAC_INTERRUPT_ENABLE_MDIOIE(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_MDIOIE_MASK)

#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19_MASK (0xFFF80000U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19_SHIFT (19U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19_WIDTH (13U)
#define GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19_SHIFT)) & GMAC_MAC_INTERRUPT_ENABLE_Reserved_31_19_MASK)
/*! @} */

/*! @name MAC_RX_TX_STATUS -  */
/*! @{ */

#define GMAC_MAC_RX_TX_STATUS_TJT_MASK           (0x1U)
#define GMAC_MAC_RX_TX_STATUS_TJT_SHIFT          (0U)
#define GMAC_MAC_RX_TX_STATUS_TJT_WIDTH          (1U)
#define GMAC_MAC_RX_TX_STATUS_TJT(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_TJT_SHIFT)) & GMAC_MAC_RX_TX_STATUS_TJT_MASK)

#define GMAC_MAC_RX_TX_STATUS_NCARR_MASK         (0x2U)
#define GMAC_MAC_RX_TX_STATUS_NCARR_SHIFT        (1U)
#define GMAC_MAC_RX_TX_STATUS_NCARR_WIDTH        (1U)
#define GMAC_MAC_RX_TX_STATUS_NCARR(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_NCARR_SHIFT)) & GMAC_MAC_RX_TX_STATUS_NCARR_MASK)

#define GMAC_MAC_RX_TX_STATUS_LCARR_MASK         (0x4U)
#define GMAC_MAC_RX_TX_STATUS_LCARR_SHIFT        (2U)
#define GMAC_MAC_RX_TX_STATUS_LCARR_WIDTH        (1U)
#define GMAC_MAC_RX_TX_STATUS_LCARR(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_LCARR_SHIFT)) & GMAC_MAC_RX_TX_STATUS_LCARR_MASK)

#define GMAC_MAC_RX_TX_STATUS_EXDEF_MASK         (0x8U)
#define GMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT        (3U)
#define GMAC_MAC_RX_TX_STATUS_EXDEF_WIDTH        (1U)
#define GMAC_MAC_RX_TX_STATUS_EXDEF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT)) & GMAC_MAC_RX_TX_STATUS_EXDEF_MASK)

#define GMAC_MAC_RX_TX_STATUS_LCOL_MASK          (0x10U)
#define GMAC_MAC_RX_TX_STATUS_LCOL_SHIFT         (4U)
#define GMAC_MAC_RX_TX_STATUS_LCOL_WIDTH         (1U)
#define GMAC_MAC_RX_TX_STATUS_LCOL(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_LCOL_SHIFT)) & GMAC_MAC_RX_TX_STATUS_LCOL_MASK)

#define GMAC_MAC_RX_TX_STATUS_EXCOL_MASK         (0x20U)
#define GMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT        (5U)
#define GMAC_MAC_RX_TX_STATUS_EXCOL_WIDTH        (1U)
#define GMAC_MAC_RX_TX_STATUS_EXCOL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT)) & GMAC_MAC_RX_TX_STATUS_EXCOL_MASK)

#define GMAC_MAC_RX_TX_STATUS_Reserved_7_6_MASK  (0xC0U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_7_6_SHIFT (6U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_7_6_WIDTH (2U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_7_6(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_Reserved_7_6_SHIFT)) & GMAC_MAC_RX_TX_STATUS_Reserved_7_6_MASK)

#define GMAC_MAC_RX_TX_STATUS_RWT_MASK           (0x100U)
#define GMAC_MAC_RX_TX_STATUS_RWT_SHIFT          (8U)
#define GMAC_MAC_RX_TX_STATUS_RWT_WIDTH          (1U)
#define GMAC_MAC_RX_TX_STATUS_RWT(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_RWT_SHIFT)) & GMAC_MAC_RX_TX_STATUS_RWT_MASK)

#define GMAC_MAC_RX_TX_STATUS_Reserved_31_9_MASK (0xFFFFFE00U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_31_9_SHIFT (9U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_31_9_WIDTH (23U)
#define GMAC_MAC_RX_TX_STATUS_Reserved_31_9(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_TX_STATUS_Reserved_31_9_SHIFT)) & GMAC_MAC_RX_TX_STATUS_Reserved_31_9_MASK)
/*! @} */

/*! @name MAC_PHYIF_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MAC_PHYIF_CONTROL_STATUS_TC_MASK    (0x1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_TC_SHIFT   (0U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_TC_WIDTH   (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_TC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_TC_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_TC_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_LUD_MASK   (0x2U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LUD_SHIFT  (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LUD_WIDTH  (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LUD(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_LUD_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_LUD_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR_MASK (0x4U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR_SHIFT (2U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SFTERR_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3_MASK (0x8U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3_SHIFT (3U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_3_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS_MASK (0x10U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS_SHIFT (4U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_SMIDRXS_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5_MASK (0xFFE0U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5_SHIFT (5U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5_WIDTH (11U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_15_5_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD_MASK (0x10000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD_SHIFT (16U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_LNKMOD_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_MASK (0x60000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_SHIFT (17U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_WIDTH (2U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_MASK)

