rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS_MASK (0x80000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS_SHIFT (19U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_LNKSTS_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO_MASK (0x100000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO_SHIFT (20U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_JABTO_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET_MASK (0x200000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET_SHIFT (21U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET_WIDTH (1U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_FALSCARDET_MASK)

#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22_MASK (0xFFC00000U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22_SHIFT (22U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22_WIDTH (10U)
#define GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22_SHIFT)) & GMAC_MAC_PHYIF_CONTROL_STATUS_Reserved_31_22_MASK)
/*! @} */

/*! @name MAC_VERSION -  */
/*! @{ */

#define GMAC_MAC_VERSION_IPVER_MASK              (0xFFU)
#define GMAC_MAC_VERSION_IPVER_SHIFT             (0U)
#define GMAC_MAC_VERSION_IPVER_WIDTH             (8U)
#define GMAC_MAC_VERSION_IPVER(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VERSION_IPVER_SHIFT)) & GMAC_MAC_VERSION_IPVER_MASK)

#define GMAC_MAC_VERSION_USERVER_MASK            (0xFF00U)
#define GMAC_MAC_VERSION_USERVER_SHIFT           (8U)
#define GMAC_MAC_VERSION_USERVER_WIDTH           (8U)
#define GMAC_MAC_VERSION_USERVER(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VERSION_USERVER_SHIFT)) & GMAC_MAC_VERSION_USERVER_MASK)

#define GMAC_MAC_VERSION_Reserved_31_16_MASK     (0xFFFF0000U)
#define GMAC_MAC_VERSION_Reserved_31_16_SHIFT    (16U)
#define GMAC_MAC_VERSION_Reserved_31_16_WIDTH    (16U)
#define GMAC_MAC_VERSION_Reserved_31_16(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VERSION_Reserved_31_16_SHIFT)) & GMAC_MAC_VERSION_Reserved_31_16_MASK)
/*! @} */

/*! @name MAC_DEBUG -  */
/*! @{ */

#define GMAC_MAC_DEBUG_RPESTS_MASK               (0x1U)
#define GMAC_MAC_DEBUG_RPESTS_SHIFT              (0U)
#define GMAC_MAC_DEBUG_RPESTS_WIDTH              (1U)
#define GMAC_MAC_DEBUG_RPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_RPESTS_SHIFT)) & GMAC_MAC_DEBUG_RPESTS_MASK)

#define GMAC_MAC_DEBUG_RFCFCSTS_MASK             (0x6U)
#define GMAC_MAC_DEBUG_RFCFCSTS_SHIFT            (1U)
#define GMAC_MAC_DEBUG_RFCFCSTS_WIDTH            (2U)
#define GMAC_MAC_DEBUG_RFCFCSTS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_RFCFCSTS_SHIFT)) & GMAC_MAC_DEBUG_RFCFCSTS_MASK)

#define GMAC_MAC_DEBUG_Reserved_15_3_MASK        (0xFFF8U)
#define GMAC_MAC_DEBUG_Reserved_15_3_SHIFT       (3U)
#define GMAC_MAC_DEBUG_Reserved_15_3_WIDTH       (13U)
#define GMAC_MAC_DEBUG_Reserved_15_3(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_Reserved_15_3_SHIFT)) & GMAC_MAC_DEBUG_Reserved_15_3_MASK)

#define GMAC_MAC_DEBUG_TPESTS_MASK               (0x10000U)
#define GMAC_MAC_DEBUG_TPESTS_SHIFT              (16U)
#define GMAC_MAC_DEBUG_TPESTS_WIDTH              (1U)
#define GMAC_MAC_DEBUG_TPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_TPESTS_SHIFT)) & GMAC_MAC_DEBUG_TPESTS_MASK)

#define GMAC_MAC_DEBUG_TFCSTS_MASK               (0x60000U)
#define GMAC_MAC_DEBUG_TFCSTS_SHIFT              (17U)
#define GMAC_MAC_DEBUG_TFCSTS_WIDTH              (2U)
#define GMAC_MAC_DEBUG_TFCSTS(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_TFCSTS_SHIFT)) & GMAC_MAC_DEBUG_TFCSTS_MASK)

#define GMAC_MAC_DEBUG_Reserved_31_19_MASK       (0xFFF80000U)
#define GMAC_MAC_DEBUG_Reserved_31_19_SHIFT      (19U)
#define GMAC_MAC_DEBUG_Reserved_31_19_WIDTH      (13U)
#define GMAC_MAC_DEBUG_Reserved_31_19(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DEBUG_Reserved_31_19_SHIFT)) & GMAC_MAC_DEBUG_Reserved_31_19_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE0 -  */
/*! @{ */

#define GMAC_MAC_HW_FEATURE0_MIISEL_MASK         (0x1U)
#define GMAC_MAC_HW_FEATURE0_MIISEL_SHIFT        (0U)
#define GMAC_MAC_HW_FEATURE0_MIISEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_MIISEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_MIISEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_MIISEL_MASK)

#define GMAC_MAC_HW_FEATURE0_GMIISEL_MASK        (0x2U)
#define GMAC_MAC_HW_FEATURE0_GMIISEL_SHIFT       (1U)
#define GMAC_MAC_HW_FEATURE0_GMIISEL_WIDTH       (1U)
#define GMAC_MAC_HW_FEATURE0_GMIISEL(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_GMIISEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_GMIISEL_MASK)

#define GMAC_MAC_HW_FEATURE0_HDSEL_MASK          (0x4U)
#define GMAC_MAC_HW_FEATURE0_HDSEL_SHIFT         (2U)
#define GMAC_MAC_HW_FEATURE0_HDSEL_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE0_HDSEL(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_HDSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_HDSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_PCSSEL_MASK         (0x8U)
#define GMAC_MAC_HW_FEATURE0_PCSSEL_SHIFT        (3U)
#define GMAC_MAC_HW_FEATURE0_PCSSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_PCSSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_PCSSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_PCSSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_VLHASH_MASK         (0x10U)
#define GMAC_MAC_HW_FEATURE0_VLHASH_SHIFT        (4U)
#define GMAC_MAC_HW_FEATURE0_VLHASH_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_VLHASH(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_VLHASH_SHIFT)) & GMAC_MAC_HW_FEATURE0_VLHASH_MASK)

#define GMAC_MAC_HW_FEATURE0_SMASEL_MASK         (0x20U)
#define GMAC_MAC_HW_FEATURE0_SMASEL_SHIFT        (5U)
#define GMAC_MAC_HW_FEATURE0_SMASEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_SMASEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_SMASEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_SMASEL_MASK)

#define GMAC_MAC_HW_FEATURE0_RWKSEL_MASK         (0x40U)
#define GMAC_MAC_HW_FEATURE0_RWKSEL_SHIFT        (6U)
#define GMAC_MAC_HW_FEATURE0_RWKSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_RWKSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_RWKSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_RWKSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_MGKSEL_MASK         (0x80U)
#define GMAC_MAC_HW_FEATURE0_MGKSEL_SHIFT        (7U)
#define GMAC_MAC_HW_FEATURE0_MGKSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_MGKSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_MGKSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_MGKSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_MMCSEL_MASK         (0x100U)
#define GMAC_MAC_HW_FEATURE0_MMCSEL_SHIFT        (8U)
#define GMAC_MAC_HW_FEATURE0_MMCSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_MMCSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_MMCSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_MMCSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_ARPOFFSEL_MASK      (0x200U)
#define GMAC_MAC_HW_FEATURE0_ARPOFFSEL_SHIFT     (9U)
#define GMAC_MAC_HW_FEATURE0_ARPOFFSEL_WIDTH     (1U)
#define GMAC_MAC_HW_FEATURE0_ARPOFFSEL(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_ARPOFFSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_ARPOFFSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_Reserved_11_10_MASK (0xC00U)
#define GMAC_MAC_HW_FEATURE0_Reserved_11_10_SHIFT (10U)
#define GMAC_MAC_HW_FEATURE0_Reserved_11_10_WIDTH (2U)
#define GMAC_MAC_HW_FEATURE0_Reserved_11_10(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_Reserved_11_10_SHIFT)) & GMAC_MAC_HW_FEATURE0_Reserved_11_10_MASK)

#define GMAC_MAC_HW_FEATURE0_TSSEL_MASK          (0x1000U)
#define GMAC_MAC_HW_FEATURE0_TSSEL_SHIFT         (12U)
#define GMAC_MAC_HW_FEATURE0_TSSEL_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE0_TSSEL(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_TSSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_TSSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_EEESEL_MASK         (0x2000U)
#define GMAC_MAC_HW_FEATURE0_EEESEL_SHIFT        (13U)
#define GMAC_MAC_HW_FEATURE0_EEESEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE0_EEESEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_EEESEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_EEESEL_MASK)

#define GMAC_MAC_HW_FEATURE0_TXCOESEL_MASK       (0x4000U)
#define GMAC_MAC_HW_FEATURE0_TXCOESEL_SHIFT      (14U)
#define GMAC_MAC_HW_FEATURE0_TXCOESEL_WIDTH      (1U)
#define GMAC_MAC_HW_FEATURE0_TXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_TXCOESEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_TXCOESEL_MASK)

#define GMAC_MAC_HW_FEATURE0_Reserved_15_MASK    (0x8000U)
#define GMAC_MAC_HW_FEATURE0_Reserved_15_SHIFT   (15U)
#define GMAC_MAC_HW_FEATURE0_Reserved_15_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE0_Reserved_15(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_Reserved_15_SHIFT)) & GMAC_MAC_HW_FEATURE0_Reserved_15_MASK)

