rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES_MASK (0x2U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES_SHIFT (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_TPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK (0x4U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT (2U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_MASK (0x8U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_SHIFT (3U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_MASK (0x10U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_SHIFT (4U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_MASK (0x20U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_SHIFT (5U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES_MASK (0x40U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES_SHIFT (6U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CWPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES_MASK (0x80U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES_SHIFT (7U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ASRPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_MASK (0x100U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_SHIFT (8U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_MASK (0x200U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_SHIFT (9U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES_MASK (0x400U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES_SHIFT (10U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_CTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_MASK (0x800U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_SHIFT (11U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_MASK (0x1000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_SHIFT (12U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES_MASK (0x2000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES_SHIFT (13U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_T125ES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES_MASK (0x4000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES_SHIFT (14U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_R125ES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES_MASK (0x8000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES_SHIFT (15U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_RVCTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_MASK (0x10000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_SHIFT (16U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES_MASK (0x20000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES_SHIFT (17U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_SLVTES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18_MASK (0xFC0000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18_SHIFT (18U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18_WIDTH (6U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_23_18_MASK)

