rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_FSM_CONTROL_RPEIN_MASK          (0x20000U)
#define GMAC_MAC_FSM_CONTROL_RPEIN_SHIFT         (17U)
#define GMAC_MAC_FSM_CONTROL_RPEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_RPEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_RPEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_RPEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_CPEIN_MASK (0x40000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CPEIN_SHIFT (18U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CPEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CPEIN(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_CPEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_CPEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_APEIN_MASK          (0x80000U)
#define GMAC_MAC_FSM_CONTROL_APEIN_SHIFT         (19U)
#define GMAC_MAC_FSM_CONTROL_APEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_APEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_APEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_APEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_PPEIN_MASK          (0x100000U)
#define GMAC_MAC_FSM_CONTROL_PPEIN_SHIFT         (20U)
#define GMAC_MAC_FSM_CONTROL_PPEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_PPEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_PPEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_PPEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN_MASK (0x200000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN_SHIFT (21U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_T125PEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN_MASK (0x400000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN_SHIFT (22U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_R125PEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN_MASK (0x800000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN_SHIFT (23U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_RVCPEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_TLGRNML_MASK        (0x1000000U)
#define GMAC_MAC_FSM_CONTROL_TLGRNML_SHIFT       (24U)
#define GMAC_MAC_FSM_CONTROL_TLGRNML_WIDTH       (1U)
#define GMAC_MAC_FSM_CONTROL_TLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_TLGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_TLGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_RLGRNML_MASK        (0x2000000U)
#define GMAC_MAC_FSM_CONTROL_RLGRNML_SHIFT       (25U)
#define GMAC_MAC_FSM_CONTROL_RLGRNML_WIDTH       (1U)
#define GMAC_MAC_FSM_CONTROL_RLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_RLGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_RLGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML_MASK (0x4000000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML_SHIFT (26U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_CLGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_ALGRNML_MASK        (0x8000000U)
#define GMAC_MAC_FSM_CONTROL_ALGRNML_SHIFT       (27U)
#define GMAC_MAC_FSM_CONTROL_ALGRNML_WIDTH       (1U)
#define GMAC_MAC_FSM_CONTROL_ALGRNML(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_ALGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_ALGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_PLGRNML_MASK        (0x10000000U)
#define GMAC_MAC_FSM_CONTROL_PLGRNML_SHIFT       (28U)
#define GMAC_MAC_FSM_CONTROL_PLGRNML_WIDTH       (1U)
#define GMAC_MAC_FSM_CONTROL_PLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_PLGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_PLGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML_MASK (0x20000000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML_SHIFT (29U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_T125LGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML_MASK (0x40000000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML_SHIFT (30U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_R125LGRNML_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML_MASK (0x80000000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML_SHIFT (31U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_RVCLGRNML_MASK)
/*! @} */

/*! @name MAC_FSM_ACT_TIMER -  */
/*! @{ */

#define GMAC_MAC_FSM_ACT_TIMER_TMR_MASK          (0x3FFU)
#define GMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT         (0U)
#define GMAC_MAC_FSM_ACT_TIMER_TMR_WIDTH         (10U)
#define GMAC_MAC_FSM_ACT_TIMER_TMR(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT)) & GMAC_MAC_FSM_ACT_TIMER_TMR_MASK)

#define GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10_MASK (0xFC00U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10_SHIFT (10U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10_WIDTH (6U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10_SHIFT)) & GMAC_MAC_FSM_ACT_TIMER_Reserved_15_10_MASK)

#define GMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK       (0xF0000U)
#define GMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT      (16U)
#define GMAC_MAC_FSM_ACT_TIMER_NTMRMD_WIDTH      (4U)
#define GMAC_MAC_FSM_ACT_TIMER_NTMRMD(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT)) & GMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK)

