rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_EXT_CFG1_SAVO_MASK              (0x7F0000U)
#define GMAC_MAC_EXT_CFG1_SAVO_SHIFT             (16U)
#define GMAC_MAC_EXT_CFG1_SAVO_WIDTH             (7U)
#define GMAC_MAC_EXT_CFG1_SAVO(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_SAVO_SHIFT)) & GMAC_MAC_EXT_CFG1_SAVO_MASK)

#define GMAC_MAC_EXT_CFG1_Reserved_23_MASK       (0x800000U)
#define GMAC_MAC_EXT_CFG1_Reserved_23_SHIFT      (23U)
#define GMAC_MAC_EXT_CFG1_Reserved_23_WIDTH      (1U)
#define GMAC_MAC_EXT_CFG1_Reserved_23(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_Reserved_23_SHIFT)) & GMAC_MAC_EXT_CFG1_Reserved_23_MASK)

#define GMAC_MAC_EXT_CFG1_SAVE_MASK              (0x1000000U)
#define GMAC_MAC_EXT_CFG1_SAVE_SHIFT             (24U)
#define GMAC_MAC_EXT_CFG1_SAVE_WIDTH             (1U)
#define GMAC_MAC_EXT_CFG1_SAVE(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_SAVE_SHIFT)) & GMAC_MAC_EXT_CFG1_SAVE_MASK)

#define GMAC_MAC_EXT_CFG1_Reserved_31_25_MASK    (0xFE000000U)
#define GMAC_MAC_EXT_CFG1_Reserved_31_25_SHIFT   (25U)
#define GMAC_MAC_EXT_CFG1_Reserved_31_25_WIDTH   (7U)
#define GMAC_MAC_EXT_CFG1_Reserved_31_25(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_Reserved_31_25_SHIFT)) & GMAC_MAC_EXT_CFG1_Reserved_31_25_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_NS -  */
/*! @{ */

#define GMAC_MAC_PRESN_TIME_NS_MPTN_MASK         (0xFFFFFFFFU)
#define GMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT        (0U)
#define GMAC_MAC_PRESN_TIME_NS_MPTN_WIDTH        (32U)
#define GMAC_MAC_PRESN_TIME_NS_MPTN(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT)) & GMAC_MAC_PRESN_TIME_NS_MPTN_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_UPDT -  */
/*! @{ */

#define GMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK       (0xFFFFFFFFU)
#define GMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT      (0U)
#define GMAC_MAC_PRESN_TIME_UPDT_MPTU_WIDTH      (32U)
#define GMAC_MAC_PRESN_TIME_UPDT_MPTU(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT)) & GMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK)
/*! @} */

/*! @name MAC_ADDRESS0_HIGH -  */
/*! @{ */

#define GMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK       (0xFFFFU)
#define GMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT      (0U)
#define GMAC_MAC_ADDRESS0_HIGH_ADDRHI_WIDTH      (16U)
#define GMAC_MAC_ADDRESS0_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT)) & GMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK)

#define GMAC_MAC_ADDRESS0_HIGH_DCS_MASK          (0x70000U)
#define GMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT         (16U)
#define GMAC_MAC_ADDRESS0_HIGH_DCS_WIDTH         (3U)
#define GMAC_MAC_ADDRESS0_HIGH_DCS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT)) & GMAC_MAC_ADDRESS0_HIGH_DCS_MASK)

#define GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y_MASK (0x7FF80000U)
#define GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y_SHIFT (19U)
#define GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y_WIDTH (12U)
#define GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y_SHIFT)) & GMAC_MAC_ADDRESS0_HIGH_Reserved_30_y_MASK)

#define GMAC_MAC_ADDRESS0_HIGH_AE_MASK           (0x80000000U)
#define GMAC_MAC_ADDRESS0_HIGH_AE_SHIFT          (31U)
#define GMAC_MAC_ADDRESS0_HIGH_AE_WIDTH          (1U)
#define GMAC_MAC_ADDRESS0_HIGH_AE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS0_HIGH_AE_SHIFT)) & GMAC_MAC_ADDRESS0_HIGH_AE_MASK)
/*! @} */

/*! @name MAC_ADDRESS0_LOW -  */
/*! @{ */

#define GMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK        (0xFFFFFFFFU)
#define GMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT       (0U)
#define GMAC_MAC_ADDRESS0_LOW_ADDRLO_WIDTH       (32U)
#define GMAC_MAC_ADDRESS0_LOW_ADDRLO(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT)) & GMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK)
/*! @} */

/*! @name MAC_ADDRESS1_HIGH -  */
/*! @{ */

#define GMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK       (0xFFFFU)
#define GMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT      (0U)
#define GMAC_MAC_ADDRESS1_HIGH_ADDRHI_WIDTH      (16U)
#define GMAC_MAC_ADDRESS1_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK)

#define GMAC_MAC_ADDRESS1_HIGH_DCS_MASK          (0x70000U)
#define GMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT         (16U)
#define GMAC_MAC_ADDRESS1_HIGH_DCS_WIDTH         (3U)
#define GMAC_MAC_ADDRESS1_HIGH_DCS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_DCS_MASK)

#define GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y_MASK (0xF80000U)
#define GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y_SHIFT (19U)
#define GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y_WIDTH (5U)
#define GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_Reserved_23_y_MASK)

#define GMAC_MAC_ADDRESS1_HIGH_MBC_MASK          (0x3F000000U)
#define GMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT         (24U)
#define GMAC_MAC_ADDRESS1_HIGH_MBC_WIDTH         (6U)
#define GMAC_MAC_ADDRESS1_HIGH_MBC(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_MBC_MASK)

#define GMAC_MAC_ADDRESS1_HIGH_SA_MASK           (0x40000000U)
#define GMAC_MAC_ADDRESS1_HIGH_SA_SHIFT          (30U)
#define GMAC_MAC_ADDRESS1_HIGH_SA_WIDTH          (1U)
#define GMAC_MAC_ADDRESS1_HIGH_SA(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_SA_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_SA_MASK)

#define GMAC_MAC_ADDRESS1_HIGH_AE_MASK           (0x80000000U)
#define GMAC_MAC_ADDRESS1_HIGH_AE_SHIFT          (31U)
#define GMAC_MAC_ADDRESS1_HIGH_AE_WIDTH          (1U)
#define GMAC_MAC_ADDRESS1_HIGH_AE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_HIGH_AE_SHIFT)) & GMAC_MAC_ADDRESS1_HIGH_AE_MASK)
/*! @} */

/*! @name MAC_ADDRESS1_LOW -  */
/*! @{ */

#define GMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK        (0xFFFFFFFFU)
#define GMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT       (0U)
#define GMAC_MAC_ADDRESS1_LOW_ADDRLO_WIDTH       (32U)
#define GMAC_MAC_ADDRESS1_LOW_ADDRLO(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT)) & GMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK)
/*! @} */

/*! @name MAC_ADDRESS2_HIGH -  */
/*! @{ */

#define GMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK       (0xFFFFU)
#define GMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT      (0U)
#define GMAC_MAC_ADDRESS2_HIGH_ADDRHI_WIDTH      (16U)
#define GMAC_MAC_ADDRESS2_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK)

