rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_ADDRESS2_HIGH_DCS_MASK          (0x70000U)
#define GMAC_MAC_ADDRESS2_HIGH_DCS_SHIFT         (16U)
#define GMAC_MAC_ADDRESS2_HIGH_DCS_WIDTH         (3U)
#define GMAC_MAC_ADDRESS2_HIGH_DCS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_DCS_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_DCS_MASK)

#define GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y_MASK (0xF80000U)
#define GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y_SHIFT (19U)
#define GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y_WIDTH (5U)
#define GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_Reserved_23_y_MASK)

#define GMAC_MAC_ADDRESS2_HIGH_MBC_MASK          (0x3F000000U)
#define GMAC_MAC_ADDRESS2_HIGH_MBC_SHIFT         (24U)
#define GMAC_MAC_ADDRESS2_HIGH_MBC_WIDTH         (6U)
#define GMAC_MAC_ADDRESS2_HIGH_MBC(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_MBC_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_MBC_MASK)

#define GMAC_MAC_ADDRESS2_HIGH_SA_MASK           (0x40000000U)
#define GMAC_MAC_ADDRESS2_HIGH_SA_SHIFT          (30U)
#define GMAC_MAC_ADDRESS2_HIGH_SA_WIDTH          (1U)
#define GMAC_MAC_ADDRESS2_HIGH_SA(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_SA_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_SA_MASK)

#define GMAC_MAC_ADDRESS2_HIGH_AE_MASK           (0x80000000U)
#define GMAC_MAC_ADDRESS2_HIGH_AE_SHIFT          (31U)
#define GMAC_MAC_ADDRESS2_HIGH_AE_WIDTH          (1U)
#define GMAC_MAC_ADDRESS2_HIGH_AE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_HIGH_AE_SHIFT)) & GMAC_MAC_ADDRESS2_HIGH_AE_MASK)
/*! @} */

/*! @name MAC_ADDRESS2_LOW -  */
/*! @{ */

#define GMAC_MAC_ADDRESS2_LOW_ADDRLO_MASK        (0xFFFFFFFFU)
#define GMAC_MAC_ADDRESS2_LOW_ADDRLO_SHIFT       (0U)
#define GMAC_MAC_ADDRESS2_LOW_ADDRLO_WIDTH       (32U)
#define GMAC_MAC_ADDRESS2_LOW_ADDRLO(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ADDRESS2_LOW_ADDRLO_SHIFT)) & GMAC_MAC_ADDRESS2_LOW_ADDRLO_MASK)
/*! @} */

/*! @name MMC_CONTROL -  */
/*! @{ */

#define GMAC_MMC_CONTROL_CNTRST_MASK             (0x1U)
#define GMAC_MMC_CONTROL_CNTRST_SHIFT            (0U)
#define GMAC_MMC_CONTROL_CNTRST_WIDTH            (1U)
#define GMAC_MMC_CONTROL_CNTRST(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_CNTRST_SHIFT)) & GMAC_MMC_CONTROL_CNTRST_MASK)

#define GMAC_MMC_CONTROL_CNTSTOPRO_MASK          (0x2U)
#define GMAC_MMC_CONTROL_CNTSTOPRO_SHIFT         (1U)
#define GMAC_MMC_CONTROL_CNTSTOPRO_WIDTH         (1U)
#define GMAC_MMC_CONTROL_CNTSTOPRO(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_CNTSTOPRO_SHIFT)) & GMAC_MMC_CONTROL_CNTSTOPRO_MASK)

#define GMAC_MMC_CONTROL_RSTONRD_MASK            (0x4U)
#define GMAC_MMC_CONTROL_RSTONRD_SHIFT           (2U)
#define GMAC_MMC_CONTROL_RSTONRD_WIDTH           (1U)
#define GMAC_MMC_CONTROL_RSTONRD(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_RSTONRD_SHIFT)) & GMAC_MMC_CONTROL_RSTONRD_MASK)

#define GMAC_MMC_CONTROL_CNTFREEZ_MASK           (0x8U)
#define GMAC_MMC_CONTROL_CNTFREEZ_SHIFT          (3U)
#define GMAC_MMC_CONTROL_CNTFREEZ_WIDTH          (1U)
#define GMAC_MMC_CONTROL_CNTFREEZ(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_CNTFREEZ_SHIFT)) & GMAC_MMC_CONTROL_CNTFREEZ_MASK)

#define GMAC_MMC_CONTROL_CNTPRST_MASK            (0x10U)
#define GMAC_MMC_CONTROL_CNTPRST_SHIFT           (4U)
#define GMAC_MMC_CONTROL_CNTPRST_WIDTH           (1U)
#define GMAC_MMC_CONTROL_CNTPRST(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_CNTPRST_SHIFT)) & GMAC_MMC_CONTROL_CNTPRST_MASK)

#define GMAC_MMC_CONTROL_CNTPRSTLVL_MASK         (0x20U)
#define GMAC_MMC_CONTROL_CNTPRSTLVL_SHIFT        (5U)
#define GMAC_MMC_CONTROL_CNTPRSTLVL_WIDTH        (1U)
#define GMAC_MMC_CONTROL_CNTPRSTLVL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_CNTPRSTLVL_SHIFT)) & GMAC_MMC_CONTROL_CNTPRSTLVL_MASK)

#define GMAC_MMC_CONTROL_Reserved_7_6_MASK       (0xC0U)
#define GMAC_MMC_CONTROL_Reserved_7_6_SHIFT      (6U)
#define GMAC_MMC_CONTROL_Reserved_7_6_WIDTH      (2U)
#define GMAC_MMC_CONTROL_Reserved_7_6(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_Reserved_7_6_SHIFT)) & GMAC_MMC_CONTROL_Reserved_7_6_MASK)

#define GMAC_MMC_CONTROL_UCDBC_MASK              (0x100U)
#define GMAC_MMC_CONTROL_UCDBC_SHIFT             (8U)
#define GMAC_MMC_CONTROL_UCDBC_WIDTH             (1U)
#define GMAC_MMC_CONTROL_UCDBC(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_UCDBC_SHIFT)) & GMAC_MMC_CONTROL_UCDBC_MASK)

#define GMAC_MMC_CONTROL_Reserved_31_9_MASK      (0xFFFFFE00U)
#define GMAC_MMC_CONTROL_Reserved_31_9_SHIFT     (9U)
#define GMAC_MMC_CONTROL_Reserved_31_9_WIDTH     (23U)
#define GMAC_MMC_CONTROL_Reserved_31_9(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_CONTROL_Reserved_31_9_SHIFT)) & GMAC_MMC_CONTROL_Reserved_31_9_MASK)
/*! @} */

/*! @name MMC_RX_INTERRUPT -  */
/*! @{ */

#define GMAC_MMC_RX_INTERRUPT_RXGBPKTIS_MASK     (0x1U)
#define GMAC_MMC_RX_INTERRUPT_RXGBPKTIS_SHIFT    (0U)
#define GMAC_MMC_RX_INTERRUPT_RXGBPKTIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXGBPKTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXGBPKTIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXGBPKTIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXGBOCTIS_MASK     (0x2U)
#define GMAC_MMC_RX_INTERRUPT_RXGBOCTIS_SHIFT    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXGBOCTIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXGBOCTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXGBOCTIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXGBOCTIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXGOCTIS_MASK      (0x4U)
#define GMAC_MMC_RX_INTERRUPT_RXGOCTIS_SHIFT     (2U)
#define GMAC_MMC_RX_INTERRUPT_RXGOCTIS_WIDTH     (1U)
#define GMAC_MMC_RX_INTERRUPT_RXGOCTIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXGOCTIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXGOCTIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXBCGPIS_MASK      (0x8U)
#define GMAC_MMC_RX_INTERRUPT_RXBCGPIS_SHIFT     (3U)
#define GMAC_MMC_RX_INTERRUPT_RXBCGPIS_WIDTH     (1U)
#define GMAC_MMC_RX_INTERRUPT_RXBCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXBCGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXBCGPIS_MASK)

