rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM_MASK (0x4000000U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM_SHIFT (26U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPIUSCIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM_MASK (0x8000000U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM_SHIFT (27U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_Reserved_RXLPITRCIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28_SHIFT (28U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28_WIDTH (4U)
#define GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_Reserved_31_28_MASK)
/*! @} */

/*! @name MMC_TX_INTERRUPT_MASK -  */
/*! @{ */

#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_MASK (0x1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_SHIFT (0U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_MASK (0x2U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_SHIFT (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM_MASK (0x4U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM_SHIFT (2U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM_MASK (0x8U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM_SHIFT (3U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_MASK (0x10U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_SHIFT (4U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_MASK (0x20U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_SHIFT (5U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_MASK (0x40U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_SHIFT (6U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_MASK (0x80U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_SHIFT (7U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_MASK (0x100U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_SHIFT (8U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_MASK (0x200U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_SHIFT (9U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_MASK (0x400U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_SHIFT (10U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_MASK (0x800U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_SHIFT (11U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_MASK (0x1000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_SHIFT (12U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_MASK (0x2000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_SHIFT (13U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_MASK (0x4000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_SHIFT (14U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_MASK)

