rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name RX_RECEIVE_ERROR_PACKETS -  */
/*! @{ */

#define GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_MASK (0xFFFFFFFFU)
#define GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_SHIFT (0U)
#define GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_WIDTH (32U)
#define GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_SHIFT)) & GMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_MASK)
/*! @} */

/*! @name RX_CONTROL_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_MASK (0xFFFFFFFFU)
#define GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_SHIFT (0U)
#define GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_WIDTH (32U)
#define GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_SHIFT)) & GMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_MASK)
/*! @} */

/*! @name MMC_FPE_TX_INTERRUPT -  */
/*! @{ */

#define GMAC_MMC_FPE_TX_INTERRUPT_FCIS_MASK      (0x1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_FCIS_SHIFT     (0U)
#define GMAC_MMC_FPE_TX_INTERRUPT_FCIS_WIDTH     (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_FCIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_FCIS_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_FCIS_MASK)

#define GMAC_MMC_FPE_TX_INTERRUPT_HRCIS_MASK     (0x2U)
#define GMAC_MMC_FPE_TX_INTERRUPT_HRCIS_SHIFT    (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_HRCIS_WIDTH    (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_HRCIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_HRCIS_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_HRCIS_MASK)

#define GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2_MASK (0xFFFFFFFCU)
#define GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2_SHIFT (2U)
#define GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2_WIDTH (30U)
#define GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_Reserved_31_2_MASK)
/*! @} */

/*! @name MMC_FPE_TX_INTERRUPT_MASK -  */
/*! @{ */

#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM_MASK (0x1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM_SHIFT (0U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM_WIDTH (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM_MASK)

#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM_MASK (0x2U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM_SHIFT (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM_WIDTH (1U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM_MASK)

#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2_MASK (0xFFFFFFFCU)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2_SHIFT (2U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2_WIDTH (30U)
#define GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2_SHIFT)) & GMAC_MMC_FPE_TX_INTERRUPT_MASK_Reserved_31_2_MASK)
/*! @} */

/*! @name MMC_TX_FPE_FRAGMENT_CNTR -  */
/*! @{ */

#define GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_MASK (0xFFFFFFFFU)
#define GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_SHIFT (0U)
#define GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_WIDTH (32U)
#define GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_SHIFT)) & GMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_MASK)
/*! @} */

/*! @name MMC_TX_HOLD_REQ_CNTR -  */
/*! @{ */

#define GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_MASK     (0xFFFFFFFFU)
#define GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_SHIFT    (0U)
#define GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_WIDTH    (32U)
#define GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_SHIFT)) & GMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_MASK)
/*! @} */

/*! @name MMC_FPE_RX_INTERRUPT -  */
/*! @{ */

#define GMAC_MMC_FPE_RX_INTERRUPT_PAECIS_MASK    (0x1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAECIS_SHIFT   (0U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAECIS_WIDTH   (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAECIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_PAECIS_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_PAECIS_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_PSECIS_MASK    (0x2U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PSECIS_SHIFT   (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PSECIS_WIDTH   (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PSECIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_PSECIS_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_PSECIS_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS_MASK    (0x4U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS_SHIFT   (2U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS_WIDTH   (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_PAOCIS_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_FCIS_MASK      (0x8U)
#define GMAC_MMC_FPE_RX_INTERRUPT_FCIS_SHIFT     (3U)
#define GMAC_MMC_FPE_RX_INTERRUPT_FCIS_WIDTH     (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_FCIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_FCIS_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_FCIS_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4_MASK (0xFFFFFFF0U)
#define GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4_SHIFT (4U)
#define GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4_WIDTH (28U)
#define GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_Reserved_31_4_MASK)
/*! @} */

/*! @name MMC_FPE_RX_INTERRUPT_MASK -  */
/*! @{ */

#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM_MASK (0x1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM_SHIFT (0U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM_WIDTH (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM_MASK (0x2U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM_SHIFT (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM_WIDTH (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM_MASK (0x4U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM_SHIFT (2U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM_WIDTH (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM_MASK)

