rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_DMCHEN0_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHEN0_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHEN0_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHEN0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_DMCHEN0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_DMCHEN0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS0 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS0_L4SP0_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS0_L4SP0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK)

#define GMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS0_L4DP0_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS0_L4DP0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG0 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG0_L3A00_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG0_L3A00(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG0 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG0_L3A10_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG0_L3A10(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG0 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG0_L3A20_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG0_L3A20(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG0 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG0_L3A30_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG0_L3A30(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL1 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL1_L3PEN1_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3PEN1_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL1_L3PEN1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3PEN1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3PEN1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3PEN1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3SAM1_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAM1_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAM1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAM1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3SAM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3SAM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3SAIM1_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAIM1_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAIM1_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3SAIM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3SAIM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3SAIM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3DAM1_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAM1_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAM1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAM1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3DAM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3DAM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3DAIM1_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAIM1_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAIM1_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L3DAIM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3DAIM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3DAIM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HSBM1_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HSBM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HDBM1_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL1_L3HDBM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L4PEN1_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL1_L4PEN1_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL1_L4PEN1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L4PEN1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L4PEN1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L4PEN1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L4SPM1_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPM1_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPM1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPM1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L4SPM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L4SPM1_MASK)

