rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL1_L4SPIM1_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPIM1_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPIM1_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L4SPIM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L4SPIM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L4SPIM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L4DPM1_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPM1_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPM1_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPM1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L4DPM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L4DPM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_L4DPIM1_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPIM1_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPIM1_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL1_L4DPIM1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_L4DPIM1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_L4DPIM1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_DMCHN1_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHN1_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHN1_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHN1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_DMCHN1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_DMCHN1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_DMCHEN1_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHEN1_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHEN1_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL1_DMCHEN1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_DMCHEN1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_DMCHEN1_MASK)

#define GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL1_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS1 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS1_L4SP1_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS1_L4SP1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK)

#define GMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS1_L4DP1_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS1_L4DP1(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG1 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG1_L3A01_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG1_L3A01(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG1 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG1_L3A11_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG1_L3A11(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG1 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG1_L3A21_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG1_L3A21(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG1 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG1_L3A31_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG1_L3A31(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL2 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL2_L3PEN2_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3PEN2_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL2_L3PEN2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3PEN2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3PEN2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3PEN2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L3SAM2_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAM2_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAM2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAM2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3SAM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3SAM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L3SAIM2_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAIM2_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAIM2_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3SAIM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3SAIM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3SAIM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L3DAM2_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAM2_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAM2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAM2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3DAM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3DAM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L3DAIM2_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAIM2_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAIM2_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L3DAIM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3DAIM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3DAIM2_MASK)

