rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HSBM2_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HSBM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HDBM2_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL2_L3HDBM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L4PEN2_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL2_L4PEN2_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL2_L4PEN2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L4PEN2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L4PEN2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L4PEN2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L4SPM2_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPM2_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPM2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPM2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L4SPM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L4SPM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L4SPIM2_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPIM2_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPIM2_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L4SPIM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L4SPIM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L4SPIM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L4DPM2_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPM2_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPM2_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPM2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L4DPM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L4DPM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_L4DPIM2_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPIM2_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPIM2_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL2_L4DPIM2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_L4DPIM2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_L4DPIM2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_DMCHN2_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHN2_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHN2_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHN2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_DMCHN2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_DMCHN2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_DMCHEN2_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHEN2_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHEN2_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL2_DMCHEN2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_DMCHEN2_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_DMCHEN2_MASK)

#define GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL2_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS2 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS2_L4SP2_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS2_L4SP2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK)

#define GMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS2_L4DP2_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS2_L4DP2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG2 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG2_L3A02_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG2_L3A02(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG2 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG2_L3A12_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG2_L3A12(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG2 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG2_L3A22_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG2_L3A22(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG2 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG2_L3A32_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG2_L3A32(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK)
/*! @} */

