rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS3 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS3_L4SP3_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS3_L4SP3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK)

#define GMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS3_L4DP3_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS3_L4DP3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG3 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG3_L3A03_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG3_L3A03(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG3 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG3_L3A13_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG3_L3A13_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG3_L3A13_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG3_L3A13(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG3_L3A13_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG3_L3A13_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG3 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG3_L3A23_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG3_L3A23_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG3_L3A23_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG3_L3A23(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG3_L3A23_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG3_L3A23_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG3 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG3_L3A33_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG3_L3A33_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG3_L3A33_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG3_L3A33(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG3_L3A33_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG3_L3A33_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL4 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL4_L3PEN4_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3PEN4_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL4_L3PEN4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3PEN4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3PEN4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3PEN4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3SAM4_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAM4_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAM4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAM4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3SAM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3SAM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3SAIM4_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAIM4_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAIM4_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3SAIM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3SAIM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3SAIM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3DAM4_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAM4_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAM4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAM4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3DAM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3DAM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3DAIM4_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAIM4_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAIM4_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L3DAIM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3DAIM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3DAIM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3HSBM4_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HSBM4_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HSBM4_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HSBM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3HSBM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3HSBM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L3HDBM4_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HDBM4_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HDBM4_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL4_L3HDBM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L3HDBM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L3HDBM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L4PEN4_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL4_L4PEN4_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL4_L4PEN4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L4PEN4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L4PEN4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L4PEN4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L4SPM4_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPM4_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPM4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPM4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L4SPM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L4SPM4_MASK)

