rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL5_L4DPM5_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPM5_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPM5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPM5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L4DPM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L4DPM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L4DPIM5_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPIM5_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPIM5_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L4DPIM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L4DPIM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L4DPIM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_DMCHN5_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHN5_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHN5_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHN5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_DMCHN5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_DMCHN5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_DMCHEN5_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHEN5_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHEN5_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL5_DMCHEN5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_DMCHEN5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_DMCHEN5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS5 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS5_L4SP5_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS5_L4SP5_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS5_L4SP5_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS5_L4SP5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS5_L4SP5_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS5_L4SP5_MASK)

#define GMAC_MAC_LAYER4_ADDRESS5_L4DP5_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS5_L4DP5_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS5_L4DP5_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS5_L4DP5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS5_L4DP5_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS5_L4DP5_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG5 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG5_L3A05_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG5_L3A05_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG5_L3A05_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG5_L3A05(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG5_L3A05_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG5_L3A05_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG5 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG5_L3A15_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG5_L3A15_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG5_L3A15_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG5_L3A15(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG5_L3A15_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG5_L3A15_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG5 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG5_L3A25_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG5_L3A25_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG5_L3A25_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG5_L3A25(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG5_L3A25_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG5_L3A25_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG5 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG5_L3A35_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG5_L3A35_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG5_L3A35_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG5_L3A35(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG5_L3A35_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG5_L3A35_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL6 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL6_L3PEN6_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3PEN6_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL6_L3PEN6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3PEN6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3PEN6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3PEN6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3SAM6_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAM6_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAM6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAM6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3SAM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3SAM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3SAIM6_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAIM6_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAIM6_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3SAIM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3SAIM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3SAIM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3DAM6_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAM6_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAM6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAM6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3DAM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3DAM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3DAIM6_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAIM6_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAIM6_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L3DAIM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3DAIM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3DAIM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3HSBM6_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HSBM6_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HSBM6_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HSBM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3HSBM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3HSBM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L3HDBM6_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HDBM6_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HDBM6_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL6_L3HDBM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L3HDBM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L3HDBM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L4PEN6_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL6_L4PEN6_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL6_L4PEN6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L4PEN6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L4PEN6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L4PEN6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L4SPM6_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPM6_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPM6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPM6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L4SPM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L4SPM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L4SPIM6_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPIM6_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPIM6_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L4SPIM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L4SPIM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L4SPIM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L4DPM6_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPM6_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPM6_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPM6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L4DPM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L4DPM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_L4DPIM6_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPIM6_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPIM6_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL6_L4DPIM6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_L4DPIM6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_L4DPIM6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_Reserved_23_22_MASK)

