rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name MAC_INDIR_ACCESS_CTRL -  */
/*! @{ */

#define GMAC_MAC_INDIR_ACCESS_CTRL_OB_MASK       (0x1U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_OB_SHIFT      (0U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_OB_WIDTH      (1U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_OB(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_OB_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_OB_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_COM_MASK      (0x2U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_COM_SHIFT     (1U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_COM_WIDTH     (1U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_COM(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_COM_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_COM_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2_MASK (0x1CU)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2_SHIFT (2U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2_WIDTH (3U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_4_2_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_AUTO_MASK     (0x20U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AUTO_SHIFT    (5U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AUTO_WIDTH    (1U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AUTO(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_AUTO_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_AUTO_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6_MASK (0xC0U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6_SHIFT (6U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6_WIDTH (2U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_7_6_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_AOFF_MASK     (0xFF00U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AOFF_SHIFT    (8U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AOFF_WIDTH    (8U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_AOFF(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_AOFF_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_AOFF_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_MSEL_MASK     (0xF0000U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_MSEL_SHIFT    (16U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_MSEL_WIDTH    (4U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_MSEL(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_MSEL_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_MSEL_MASK)

#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20_SHIFT)) & GMAC_MAC_INDIR_ACCESS_CTRL_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_INDIR_ACCESS_DATA -  */
/*! @{ */

#define GMAC_MAC_INDIR_ACCESS_DATA_DATA_MASK     (0xFFFFFFFFU)
#define GMAC_MAC_INDIR_ACCESS_DATA_DATA_SHIFT    (0U)
#define GMAC_MAC_INDIR_ACCESS_DATA_DATA_WIDTH    (32U)
#define GMAC_MAC_INDIR_ACCESS_DATA_DATA(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INDIR_ACCESS_DATA_DATA_SHIFT)) & GMAC_MAC_INDIR_ACCESS_DATA_DATA_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS0 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS0_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS0_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS0_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS0_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS0_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS0_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS0_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS0_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS0_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS0_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS0_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS0_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS0_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS0_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS0_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS0_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS0_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS0_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS0_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS0_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS0_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS0_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS0_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS0_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS0_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS1 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS1_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS1_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS1_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS1_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS1_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS1_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS1_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS1_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS1_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS1_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS1_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS1_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS1_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS1_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS1_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS1_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS1_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS1_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS1_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS1_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS1_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS1_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS1_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS1_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS1_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS2 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS2_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS2_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS2_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS2_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS2_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS2_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS2_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS2_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS2_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS2_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS2_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS2_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS2_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS2_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS2_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS2_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS2_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS2_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS2_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS2_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS2_PFEX_MASK)

