rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name MAC_TMRQ_REGS7 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS7_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS7_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS7_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS7_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS7_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS7_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS7_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS7_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS7_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS7_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS7_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS7_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS7_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS7_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS7_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS7_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS7_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS7_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS7_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS7_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS7_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS7_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS7_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS7_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS7_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_CONTROL -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_CONTROL_TSENA_MASK    (0x1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENA_SHIFT   (0U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENA_WIDTH   (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENA(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT_MASK (0x2U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT_SHIFT (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSINIT_MASK   (0x4U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSINIT_SHIFT  (2U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSINIT_WIDTH  (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSINIT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSINIT_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSINIT_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT_MASK   (0x8U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT_SHIFT  (3U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT_WIDTH  (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSUPDT_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG_MASK (0x10U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG_SHIFT (4U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_TSTRIG_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG_MASK (0x20U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG_SHIFT (5U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSADDREG_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_PTGE_MASK     (0x40U)
#define GMAC_MAC_TIMESTAMP_CONTROL_PTGE_SHIFT    (6U)
#define GMAC_MAC_TIMESTAMP_CONTROL_PTGE_WIDTH    (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_PTGE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_PTGE_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_PTGE_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7_MASK (0x80U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7_SHIFT (7U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_7_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSENALL_MASK  (0x100U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENALL_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENALL_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENALL(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSENALL_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSENALL_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MASK (0x200U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_SHIFT (9U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA_MASK (0x400U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA_SHIFT (10U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA_MASK  (0x800U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA_SHIFT (11U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSIPENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_MASK (0x1000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_SHIFT (12U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_MASK (0x2000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_SHIFT (13U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA_MASK (0x4000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA_SHIFT (14U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA_MASK)

