rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA_MASK (0x8000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA_SHIFT (15U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_MASK (0x30000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_WIDTH (2U)
#define GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR_MASK (0x40000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR_SHIFT (18U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC_MASK (0x80000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC_SHIFT (19U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_CSC_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_ESTI_MASK     (0x100000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_ESTI_SHIFT    (20U)
#define GMAC_MAC_TIMESTAMP_CONTROL_ESTI_WIDTH    (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_ESTI(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_ESTI_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_ESTI_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_23_21_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM_MASK (0x1000000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM_SHIFT (24U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25_MASK (0xE000000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25_SHIFT (25U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25_WIDTH (3U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_27_25_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_MASK (0x10000000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_SHIFT (28U)
#define GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN_MASK)

#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29_SHIFT)) & GMAC_MAC_TIMESTAMP_CONTROL_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_SUB_SECOND_INCREMENT -  */
/*! @{ */

#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0_MASK (0xFFU)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0_SHIFT (0U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0_WIDTH (8U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0_SHIFT)) & GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_7_0_MASK)

#define GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_MASK (0xFF00U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_SHIFT (8U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_WIDTH (8U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_SHIFT)) & GMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_MASK)

#define GMAC_MAC_SUB_SECOND_INCREMENT_SSINC_MASK (0xFF0000U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SSINC_SHIFT (16U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SSINC_WIDTH (8U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_SSINC(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SUB_SECOND_INCREMENT_SSINC_SHIFT)) & GMAC_MAC_SUB_SECOND_INCREMENT_SSINC_MASK)

#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24_SHIFT (24U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24_WIDTH (8U)
#define GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24_SHIFT)) & GMAC_MAC_SUB_SECOND_INCREMENT_Reserved_31_24_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_SECONDS -  */
/*! @{ */

#define GMAC_MAC_SYSTEM_TIME_SECONDS_TSS_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_TSS_SHIFT   (0U)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_TSS_WIDTH   (32U)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_TSS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_SECONDS_TSS_SHIFT)) & GMAC_MAC_SYSTEM_TIME_SECONDS_TSS_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_NANOSECONDS -  */
/*! @{ */

#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MASK (0x7FFFFFFFU)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_SHIFT (0U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_WIDTH (31U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_SHIFT)) & GMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MASK)

#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31_MASK (0x80000000U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31_SHIFT (31U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31_WIDTH (1U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31_SHIFT)) & GMAC_MAC_SYSTEM_TIME_NANOSECONDS_Reserved_31_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_SECONDS_UPDATE -  */
/*! @{ */

