rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK (0xFFFFFFFFU)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT (0U)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_WIDTH (32U)
#define GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT)) & GMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_NANOSECONDS_UPDATE -  */
/*! @{ */

#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK (0x7FFFFFFFU)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT (0U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_WIDTH (31U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT)) & GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK)

#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK (0x80000000U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_SHIFT (31U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_WIDTH (1U)
#define GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_SHIFT)) & GMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_ADDEND -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_ADDEND_TSAR_MASK      (0xFFFFFFFFU)
#define GMAC_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT     (0U)
#define GMAC_MAC_TIMESTAMP_ADDEND_TSAR_WIDTH     (32U)
#define GMAC_MAC_TIMESTAMP_ADDEND_TSAR(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT)) & GMAC_MAC_TIMESTAMP_ADDEND_TSAR_MASK)
/*! @} */

/*! @name MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS -  */
/*! @{ */

#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MASK (0xFFFFU)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_SHIFT (0U)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_WIDTH (16U)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_SHIFT)) & GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MASK)

#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16_SHIFT (16U)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16_WIDTH (16U)
#define GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16_SHIFT)) & GMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_Reserved_31_16_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_STATUS -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_STATUS_TSSOVF_MASK    (0x1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSSOVF_SHIFT   (0U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSSOVF_WIDTH   (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSSOVF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSSOVF_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSSOVF_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0_MASK  (0x2U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0_SHIFT (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTARGT0_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG_MASK (0x4U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG_SHIFT (2U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_AUXTSTRIG_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0_MASK (0x8U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0_SHIFT (3U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1_MASK  (0x10U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1_SHIFT (4U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTARGT1_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1_MASK (0x20U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1_SHIFT (5U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2_MASK  (0x40U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2_SHIFT (6U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTARGT2_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2_MASK (0x80U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2_SHIFT (7U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3_MASK  (0x100U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTARGT3_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3_MASK (0x200U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3_SHIFT (9U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10_MASK (0x7C00U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10_SHIFT (10U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10_WIDTH (5U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_14_10_MASK)

