rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_DBG_CTL_STSIE_MASK              (0x8000U)
#define GMAC_MTL_DBG_CTL_STSIE_SHIFT             (15U)
#define GMAC_MTL_DBG_CTL_STSIE_WIDTH             (1U)
#define GMAC_MTL_DBG_CTL_STSIE(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_STSIE_SHIFT)) & GMAC_MTL_DBG_CTL_STSIE_MASK)

#define GMAC_MTL_DBG_CTL_EIEE_MASK               (0x10000U)
#define GMAC_MTL_DBG_CTL_EIEE_SHIFT              (16U)
#define GMAC_MTL_DBG_CTL_EIEE_WIDTH              (1U)
#define GMAC_MTL_DBG_CTL_EIEE(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_EIEE_SHIFT)) & GMAC_MTL_DBG_CTL_EIEE_MASK)

#define GMAC_MTL_DBG_CTL_EIAEE_MASK              (0x20000U)
#define GMAC_MTL_DBG_CTL_EIAEE_SHIFT             (17U)
#define GMAC_MTL_DBG_CTL_EIAEE_WIDTH             (1U)
#define GMAC_MTL_DBG_CTL_EIAEE(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_EIAEE_SHIFT)) & GMAC_MTL_DBG_CTL_EIAEE_MASK)

#define GMAC_MTL_DBG_CTL_EIEC_MASK               (0x40000U)
#define GMAC_MTL_DBG_CTL_EIEC_SHIFT              (18U)
#define GMAC_MTL_DBG_CTL_EIEC_WIDTH              (1U)
#define GMAC_MTL_DBG_CTL_EIEC(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_EIEC_SHIFT)) & GMAC_MTL_DBG_CTL_EIEC_MASK)

#define GMAC_MTL_DBG_CTL_Reserved_31_19_MASK     (0xFFF80000U)
#define GMAC_MTL_DBG_CTL_Reserved_31_19_SHIFT    (19U)
#define GMAC_MTL_DBG_CTL_Reserved_31_19_WIDTH    (13U)
#define GMAC_MTL_DBG_CTL_Reserved_31_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_Reserved_31_19_SHIFT)) & GMAC_MTL_DBG_CTL_Reserved_31_19_MASK)
/*! @} */

/*! @name MTL_DBG_STS -  */
/*! @{ */

#define GMAC_MTL_DBG_STS_FIFOBUSY_MASK           (0x1U)
#define GMAC_MTL_DBG_STS_FIFOBUSY_SHIFT          (0U)
#define GMAC_MTL_DBG_STS_FIFOBUSY_WIDTH          (1U)
#define GMAC_MTL_DBG_STS_FIFOBUSY(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_FIFOBUSY_SHIFT)) & GMAC_MTL_DBG_STS_FIFOBUSY_MASK)

#define GMAC_MTL_DBG_STS_PKTSTATE_MASK           (0x6U)
#define GMAC_MTL_DBG_STS_PKTSTATE_SHIFT          (1U)
#define GMAC_MTL_DBG_STS_PKTSTATE_WIDTH          (2U)
#define GMAC_MTL_DBG_STS_PKTSTATE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_PKTSTATE_SHIFT)) & GMAC_MTL_DBG_STS_PKTSTATE_MASK)

#define GMAC_MTL_DBG_STS_BYTEEN_MASK             (0x18U)
#define GMAC_MTL_DBG_STS_BYTEEN_SHIFT            (3U)
#define GMAC_MTL_DBG_STS_BYTEEN_WIDTH            (2U)
#define GMAC_MTL_DBG_STS_BYTEEN(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_BYTEEN_SHIFT)) & GMAC_MTL_DBG_STS_BYTEEN_MASK)

#define GMAC_MTL_DBG_STS_Reserved_7_5_MASK       (0xE0U)
#define GMAC_MTL_DBG_STS_Reserved_7_5_SHIFT      (5U)
#define GMAC_MTL_DBG_STS_Reserved_7_5_WIDTH      (3U)
#define GMAC_MTL_DBG_STS_Reserved_7_5(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_Reserved_7_5_SHIFT)) & GMAC_MTL_DBG_STS_Reserved_7_5_MASK)

#define GMAC_MTL_DBG_STS_PKTI_MASK               (0x100U)
#define GMAC_MTL_DBG_STS_PKTI_SHIFT              (8U)
#define GMAC_MTL_DBG_STS_PKTI_WIDTH              (1U)
#define GMAC_MTL_DBG_STS_PKTI(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_PKTI_SHIFT)) & GMAC_MTL_DBG_STS_PKTI_MASK)

#define GMAC_MTL_DBG_STS_STSI_MASK               (0x200U)
#define GMAC_MTL_DBG_STS_STSI_SHIFT              (9U)
#define GMAC_MTL_DBG_STS_STSI_WIDTH              (1U)
#define GMAC_MTL_DBG_STS_STSI(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_STSI_SHIFT)) & GMAC_MTL_DBG_STS_STSI_MASK)

#define GMAC_MTL_DBG_STS_Reserved_14_10_MASK     (0x7C00U)
#define GMAC_MTL_DBG_STS_Reserved_14_10_SHIFT    (10U)
#define GMAC_MTL_DBG_STS_Reserved_14_10_WIDTH    (5U)
#define GMAC_MTL_DBG_STS_Reserved_14_10(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_Reserved_14_10_SHIFT)) & GMAC_MTL_DBG_STS_Reserved_14_10_MASK)

#define GMAC_MTL_DBG_STS_LOCR_MASK               (0xFFFF8000U)
#define GMAC_MTL_DBG_STS_LOCR_SHIFT              (15U)
#define GMAC_MTL_DBG_STS_LOCR_WIDTH              (17U)
#define GMAC_MTL_DBG_STS_LOCR(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_STS_LOCR_SHIFT)) & GMAC_MTL_DBG_STS_LOCR_MASK)
/*! @} */

/*! @name MTL_FIFO_DEBUG_DATA -  */
/*! @{ */

#define GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK   (0xFFFFFFFFU)
#define GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT  (0U)
#define GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_WIDTH  (32U)
#define GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT)) & GMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK)
/*! @} */

/*! @name MTL_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_MTL_INTERRUPT_STATUS_Q0IS_MASK      (0x1U)
#define GMAC_MTL_INTERRUPT_STATUS_Q0IS_SHIFT     (0U)
#define GMAC_MTL_INTERRUPT_STATUS_Q0IS_WIDTH     (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Q0IS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Q0IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Q0IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Q1IS_MASK      (0x2U)
#define GMAC_MTL_INTERRUPT_STATUS_Q1IS_SHIFT     (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Q1IS_WIDTH     (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Q1IS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Q1IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Q1IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Q2IS_MASK      (0x4U)
#define GMAC_MTL_INTERRUPT_STATUS_Q2IS_SHIFT     (2U)
#define GMAC_MTL_INTERRUPT_STATUS_Q2IS_WIDTH     (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Q2IS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Q2IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Q2IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS_MASK (0x8U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS_SHIFT (3U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_Q3IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS_MASK (0x10U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS_SHIFT (4U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_Q4IS_MASK)

