rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS_MASK (0x20U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS_SHIFT (5U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_Q5IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS_MASK (0x40U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS_SHIFT (6U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_Q6IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS_MASK (0x80U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS_SHIFT (7U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_Q7IS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8_MASK (0xFF00U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8_SHIFT (8U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8_WIDTH (8U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_15_8_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS_MASK (0x10000U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS_SHIFT (16U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS_WIDTH (1U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_MACIS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_DBGIS_MASK     (0x20000U)
#define GMAC_MTL_INTERRUPT_STATUS_DBGIS_SHIFT    (17U)
#define GMAC_MTL_INTERRUPT_STATUS_DBGIS_WIDTH    (1U)
#define GMAC_MTL_INTERRUPT_STATUS_DBGIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_DBGIS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_DBGIS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_ESTIS_MASK     (0x40000U)
#define GMAC_MTL_INTERRUPT_STATUS_ESTIS_SHIFT    (18U)
#define GMAC_MTL_INTERRUPT_STATUS_ESTIS_WIDTH    (1U)
#define GMAC_MTL_INTERRUPT_STATUS_ESTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_ESTIS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_ESTIS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19_MASK (0x780000U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19_SHIFT (19U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19_WIDTH (4U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_22_19_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_MTLPIS_MASK    (0x800000U)
#define GMAC_MTL_INTERRUPT_STATUS_MTLPIS_SHIFT   (23U)
#define GMAC_MTL_INTERRUPT_STATUS_MTLPIS_WIDTH   (1U)
#define GMAC_MTL_INTERRUPT_STATUS_MTLPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_MTLPIS_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_MTLPIS_MASK)

#define GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24_SHIFT (24U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24_WIDTH (8U)
#define GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24_SHIFT)) & GMAC_MTL_INTERRUPT_STATUS_Reserved_31_24_MASK)
/*! @} */

/*! @name MTL_RXQ_DMA_MAP0 -  */
/*! @{ */

#define GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_MASK      (0x3U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_SHIFT     (0U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_WIDTH     (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y_MASK  (0xCU)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y_SHIFT (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y_WIDTH (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_3_y_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_MASK      (0x10U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_SHIFT     (4U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_WIDTH     (1U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5_MASK  (0xE0U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5_SHIFT (5U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5_WIDTH (3U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_7_5_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_MASK      (0x300U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_SHIFT     (8U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_WIDTH     (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y_MASK (0xC00U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y_SHIFT (10U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y_WIDTH (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_11_y_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_MASK      (0x1000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_SHIFT     (12U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_WIDTH     (1U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13_MASK (0xE000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13_SHIFT (13U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13_WIDTH (3U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_15_13_MASK)

