rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_EST_CONTROL_Reserved_11_MASK    (0x800U)
#define GMAC_MTL_EST_CONTROL_Reserved_11_SHIFT   (11U)
#define GMAC_MTL_EST_CONTROL_Reserved_11_WIDTH   (1U)
#define GMAC_MTL_EST_CONTROL_Reserved_11(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_Reserved_11_SHIFT)) & GMAC_MTL_EST_CONTROL_Reserved_11_MASK)

#define GMAC_MTL_EST_CONTROL_CTOV_MASK           (0xFFF000U)
#define GMAC_MTL_EST_CONTROL_CTOV_SHIFT          (12U)
#define GMAC_MTL_EST_CONTROL_CTOV_WIDTH          (12U)
#define GMAC_MTL_EST_CONTROL_CTOV(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_CTOV_SHIFT)) & GMAC_MTL_EST_CONTROL_CTOV_MASK)

#define GMAC_MTL_EST_CONTROL_PTOV_MASK           (0xFF000000U)
#define GMAC_MTL_EST_CONTROL_PTOV_SHIFT          (24U)
#define GMAC_MTL_EST_CONTROL_PTOV_WIDTH          (8U)
#define GMAC_MTL_EST_CONTROL_PTOV(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_PTOV_SHIFT)) & GMAC_MTL_EST_CONTROL_PTOV_MASK)
/*! @} */

/*! @name MTL_EST_EXT_CONTROL -  */
/*! @{ */

#define GMAC_MTL_EST_EXT_CONTROL_OVHD_MASK       (0x3FU)
#define GMAC_MTL_EST_EXT_CONTROL_OVHD_SHIFT      (0U)
#define GMAC_MTL_EST_EXT_CONTROL_OVHD_WIDTH      (6U)
#define GMAC_MTL_EST_EXT_CONTROL_OVHD(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_EXT_CONTROL_OVHD_SHIFT)) & GMAC_MTL_EST_EXT_CONTROL_OVHD_MASK)

#define GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6_MASK (0xFFFFFFC0U)
#define GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6_SHIFT (6U)
#define GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6_WIDTH (26U)
#define GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6_SHIFT)) & GMAC_MTL_EST_EXT_CONTROL_Reserved_31_6_MASK)
/*! @} */

/*! @name MTL_EST_STATUS -  */
/*! @{ */

#define GMAC_MTL_EST_STATUS_SWLC_MASK            (0x1U)
#define GMAC_MTL_EST_STATUS_SWLC_SHIFT           (0U)
#define GMAC_MTL_EST_STATUS_SWLC_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_SWLC(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_SWLC_SHIFT)) & GMAC_MTL_EST_STATUS_SWLC_MASK)

#define GMAC_MTL_EST_STATUS_BTRE_MASK            (0x2U)
#define GMAC_MTL_EST_STATUS_BTRE_SHIFT           (1U)
#define GMAC_MTL_EST_STATUS_BTRE_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_BTRE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_BTRE_SHIFT)) & GMAC_MTL_EST_STATUS_BTRE_MASK)

#define GMAC_MTL_EST_STATUS_HLBF_MASK            (0x4U)
#define GMAC_MTL_EST_STATUS_HLBF_SHIFT           (2U)
#define GMAC_MTL_EST_STATUS_HLBF_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_HLBF(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_HLBF_SHIFT)) & GMAC_MTL_EST_STATUS_HLBF_MASK)

#define GMAC_MTL_EST_STATUS_HLBS_MASK            (0x8U)
#define GMAC_MTL_EST_STATUS_HLBS_SHIFT           (3U)
#define GMAC_MTL_EST_STATUS_HLBS_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_HLBS(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_HLBS_SHIFT)) & GMAC_MTL_EST_STATUS_HLBS_MASK)

#define GMAC_MTL_EST_STATUS_CGCE_MASK            (0x10U)
#define GMAC_MTL_EST_STATUS_CGCE_SHIFT           (4U)
#define GMAC_MTL_EST_STATUS_CGCE_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_CGCE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_CGCE_SHIFT)) & GMAC_MTL_EST_STATUS_CGCE_MASK)

#define GMAC_MTL_EST_STATUS_Reserved_6_5_MASK    (0x60U)
#define GMAC_MTL_EST_STATUS_Reserved_6_5_SHIFT   (5U)
#define GMAC_MTL_EST_STATUS_Reserved_6_5_WIDTH   (2U)
#define GMAC_MTL_EST_STATUS_Reserved_6_5(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_Reserved_6_5_SHIFT)) & GMAC_MTL_EST_STATUS_Reserved_6_5_MASK)

#define GMAC_MTL_EST_STATUS_SWOL_MASK            (0x80U)
#define GMAC_MTL_EST_STATUS_SWOL_SHIFT           (7U)
#define GMAC_MTL_EST_STATUS_SWOL_WIDTH           (1U)
#define GMAC_MTL_EST_STATUS_SWOL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_SWOL_SHIFT)) & GMAC_MTL_EST_STATUS_SWOL_MASK)

#define GMAC_MTL_EST_STATUS_BTRL_MASK            (0xFF00U)
#define GMAC_MTL_EST_STATUS_BTRL_SHIFT           (8U)
#define GMAC_MTL_EST_STATUS_BTRL_WIDTH           (8U)
#define GMAC_MTL_EST_STATUS_BTRL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_BTRL_SHIFT)) & GMAC_MTL_EST_STATUS_BTRL_MASK)

#define GMAC_MTL_EST_STATUS_CGSN_MASK            (0xF0000U)
#define GMAC_MTL_EST_STATUS_CGSN_SHIFT           (16U)
#define GMAC_MTL_EST_STATUS_CGSN_WIDTH           (4U)
#define GMAC_MTL_EST_STATUS_CGSN(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_CGSN_SHIFT)) & GMAC_MTL_EST_STATUS_CGSN_MASK)

#define GMAC_MTL_EST_STATUS_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MTL_EST_STATUS_Reserved_31_20_SHIFT (20U)
#define GMAC_MTL_EST_STATUS_Reserved_31_20_WIDTH (12U)
#define GMAC_MTL_EST_STATUS_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_STATUS_Reserved_31_20_SHIFT)) & GMAC_MTL_EST_STATUS_Reserved_31_20_MASK)
/*! @} */

/*! @name MTL_EST_SCH_ERROR -  */
/*! @{ */

#define GMAC_MTL_EST_SCH_ERROR_SEQN_MASK         (0x7U)
#define GMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT        (0U)
#define GMAC_MTL_EST_SCH_ERROR_SEQN_WIDTH        (3U)
#define GMAC_MTL_EST_SCH_ERROR_SEQN(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT)) & GMAC_MTL_EST_SCH_ERROR_SEQN_MASK)

#define GMAC_MTL_EST_SCH_ERROR_Reserved_31_x_MASK (0xFFFFFFF8U)
#define GMAC_MTL_EST_SCH_ERROR_Reserved_31_x_SHIFT (3U)
#define GMAC_MTL_EST_SCH_ERROR_Reserved_31_x_WIDTH (29U)
#define GMAC_MTL_EST_SCH_ERROR_Reserved_31_x(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_SCH_ERROR_Reserved_31_x_SHIFT)) & GMAC_MTL_EST_SCH_ERROR_Reserved_31_x_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_ERROR -  */
/*! @{ */

#define GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK    (0x7U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT   (0U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_WIDTH   (3U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK)

