rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x_MASK (0xFFFFFFF8U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x_SHIFT (3U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x_WIDTH (29U)
#define GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_ERROR_Reserved_31_x_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_CAPTURE -  */
/*! @{ */

#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK  (0x7FFFU)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT (0U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_WIDTH (15U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK)

#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15_MASK (0x8000U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15_SHIFT (15U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15_WIDTH (1U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_15_MASK)

#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK  (0x30000U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT (16U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_WIDTH (2U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK)

#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x_MASK (0xFFFC0000U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x_SHIFT (18U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x_WIDTH (14U)
#define GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x_SHIFT)) & GMAC_MTL_EST_FRM_SIZE_CAPTURE_Reserved_31_x_MASK)
/*! @} */

/*! @name MTL_EST_INTR_ENABLE -  */
/*! @{ */

#define GMAC_MTL_EST_INTR_ENABLE_IECC_MASK       (0x1U)
#define GMAC_MTL_EST_INTR_ENABLE_IECC_SHIFT      (0U)
#define GMAC_MTL_EST_INTR_ENABLE_IECC_WIDTH      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_IECC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_IECC_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_IECC_MASK)

#define GMAC_MTL_EST_INTR_ENABLE_IEBE_MASK       (0x2U)
#define GMAC_MTL_EST_INTR_ENABLE_IEBE_SHIFT      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_IEBE_WIDTH      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_IEBE(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_IEBE_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_IEBE_MASK)

#define GMAC_MTL_EST_INTR_ENABLE_IEHF_MASK       (0x4U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHF_SHIFT      (2U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHF_WIDTH      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHF(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_IEHF_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_IEHF_MASK)

#define GMAC_MTL_EST_INTR_ENABLE_IEHS_MASK       (0x8U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHS_SHIFT      (3U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHS_WIDTH      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_IEHS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_IEHS_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_IEHS_MASK)

#define GMAC_MTL_EST_INTR_ENABLE_CGCE_MASK       (0x10U)
#define GMAC_MTL_EST_INTR_ENABLE_CGCE_SHIFT      (4U)
#define GMAC_MTL_EST_INTR_ENABLE_CGCE_WIDTH      (1U)
#define GMAC_MTL_EST_INTR_ENABLE_CGCE(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_CGCE_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_CGCE_MASK)

#define GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5_MASK (0xFFFFFFE0U)
#define GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5_SHIFT (5U)
#define GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5_WIDTH (27U)
#define GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5_SHIFT)) & GMAC_MTL_EST_INTR_ENABLE_Reserved_31_5_MASK)
/*! @} */

/*! @name MTL_EST_GCL_CONTROL -  */
/*! @{ */

#define GMAC_MTL_EST_GCL_CONTROL_SRWO_MASK       (0x1U)
#define GMAC_MTL_EST_GCL_CONTROL_SRWO_SHIFT      (0U)
#define GMAC_MTL_EST_GCL_CONTROL_SRWO_WIDTH      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_SRWO(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_SRWO_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_SRWO_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_R1W0_MASK       (0x2U)
#define GMAC_MTL_EST_GCL_CONTROL_R1W0_SHIFT      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_R1W0_WIDTH      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_R1W0(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_R1W0_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_R1W0_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_GCRR_MASK       (0x4U)
#define GMAC_MTL_EST_GCL_CONTROL_GCRR_SHIFT      (2U)
#define GMAC_MTL_EST_GCL_CONTROL_GCRR_WIDTH      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_GCRR(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_GCRR_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_GCRR_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_Reserved_3_MASK (0x8U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_3_SHIFT (3U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_3_WIDTH (1U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_3(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_Reserved_3_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_Reserved_3_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_DBGM_MASK       (0x10U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGM_SHIFT      (4U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGM_WIDTH      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGM(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_DBGM_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_DBGM_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_DBGB_MASK       (0x20U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGB_SHIFT      (5U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGB_WIDTH      (1U)
#define GMAC_MTL_EST_GCL_CONTROL_DBGB(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_DBGB_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_DBGB_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6_MASK (0xC0U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6_SHIFT (6U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6_WIDTH (2U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_Reserved_7_6_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_ADDR_MASK       (0xFF00U)
#define GMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT      (8U)
#define GMAC_MTL_EST_GCL_CONTROL_ADDR_WIDTH      (8U)
#define GMAC_MTL_EST_GCL_CONTROL_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_ADDR_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y_MASK (0x1F0000U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y_SHIFT (16U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y_WIDTH (5U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_Reserved_20_y_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEE_MASK    (0x200000U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT   (21U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEE_WIDTH   (1U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEE(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_ESTEIEE_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE_MASK   (0x400000U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE_SHIFT  (22U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE_WIDTH  (1U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_ESTEIAEE_MASK)

