rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name MTL_ECC_ERR_ADDR_STATUS -  */
/*! @{ */

#define GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK  (0xFFFFU)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT (0U)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_WIDTH (16U)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT)) & GMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK)

#define GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK  (0xFFFF0000U)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT (16U)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_WIDTH (16U)
#define GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT)) & GMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK)
/*! @} */

/*! @name MTL_ECC_ERR_CNTR_STATUS -  */
/*! @{ */

#define GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK  (0xFFU)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT (0U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_WIDTH (8U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT)) & GMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK)

#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8_MASK (0xFF00U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8_SHIFT (8U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8_WIDTH (8U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8_SHIFT)) & GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_15_8_MASK)

#define GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK  (0xF0000U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT (16U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_WIDTH (4U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT)) & GMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK)

#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20_SHIFT (20U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20_WIDTH (12U)
#define GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20_SHIFT)) & GMAC_MTL_ECC_ERR_CNTR_STATUS_Reserved_31_20_MASK)
/*! @} */

/*! @name MTL_DPP_CONTROL -  */
/*! @{ */

#define GMAC_MTL_DPP_CONTROL_EDPP_MASK           (0x1U)
#define GMAC_MTL_DPP_CONTROL_EDPP_SHIFT          (0U)
#define GMAC_MTL_DPP_CONTROL_EDPP_WIDTH          (1U)
#define GMAC_MTL_DPP_CONTROL_EDPP(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_EDPP_SHIFT)) & GMAC_MTL_DPP_CONTROL_EDPP_MASK)

#define GMAC_MTL_DPP_CONTROL_OPE_MASK            (0x2U)
#define GMAC_MTL_DPP_CONTROL_OPE_SHIFT           (1U)
#define GMAC_MTL_DPP_CONTROL_OPE_WIDTH           (1U)
#define GMAC_MTL_DPP_CONTROL_OPE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_OPE_SHIFT)) & GMAC_MTL_DPP_CONTROL_OPE_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_EPSI_MASK  (0x4U)
#define GMAC_MTL_DPP_CONTROL_Reserved_EPSI_SHIFT (2U)
#define GMAC_MTL_DPP_CONTROL_Reserved_EPSI_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_EPSI(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_EPSI_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_EPSI_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_3_MASK     (0x8U)
#define GMAC_MTL_DPP_CONTROL_Reserved_3_SHIFT    (3U)
#define GMAC_MTL_DPP_CONTROL_Reserved_3_WIDTH    (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_3_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_3_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_IPETID_MASK (0x10U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETID_SHIFT (4U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETID_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETID(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPETID_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPETID_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_IPETH_MASK (0x20U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETH_SHIFT (5U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETH_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPETH(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPETH_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPETH_MASK)

#define GMAC_MTL_DPP_CONTROL_IPETRD_MASK         (0x40U)
#define GMAC_MTL_DPP_CONTROL_IPETRD_SHIFT        (6U)
#define GMAC_MTL_DPP_CONTROL_IPETRD_WIDTH        (1U)
#define GMAC_MTL_DPP_CONTROL_IPETRD(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPETRD_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPETRD_MASK)

#define GMAC_MTL_DPP_CONTROL_IPEMTF_MASK         (0x80U)
#define GMAC_MTL_DPP_CONTROL_IPEMTF_SHIFT        (7U)
#define GMAC_MTL_DPP_CONTROL_IPEMTF_WIDTH        (1U)
#define GMAC_MTL_DPP_CONTROL_IPEMTF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPEMTF_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPEMTF_MASK)

#define GMAC_MTL_DPP_CONTROL_IPEMTS_MASK         (0x100U)
#define GMAC_MTL_DPP_CONTROL_IPEMTS_SHIFT        (8U)
#define GMAC_MTL_DPP_CONTROL_IPEMTS_WIDTH        (1U)
#define GMAC_MTL_DPP_CONTROL_IPEMTS(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPEMTS_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPEMTS_MASK)

#define GMAC_MTL_DPP_CONTROL_IPERID_MASK         (0x200U)
#define GMAC_MTL_DPP_CONTROL_IPERID_SHIFT        (9U)
#define GMAC_MTL_DPP_CONTROL_IPERID_WIDTH        (1U)
#define GMAC_MTL_DPP_CONTROL_IPERID(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPERID_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPERID_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASW_MASK (0x400U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASW_SHIFT (10U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASW_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASW(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPEASW_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPEASW_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW_MASK (0x800U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW_SHIFT (11U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPEMSW_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASR_MASK (0x1000U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASR_SHIFT (12U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASR_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEASR(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPEASR_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPEASR_MASK)

#define GMAC_MTL_DPP_CONTROL_IPEMTBU_MASK        (0x2000U)
#define GMAC_MTL_DPP_CONTROL_IPEMTBU_SHIFT       (13U)
#define GMAC_MTL_DPP_CONTROL_IPEMTBU_WIDTH       (1U)
#define GMAC_MTL_DPP_CONTROL_IPEMTBU(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPEMTBU_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPEMTBU_MASK)

#define GMAC_MTL_DPP_CONTROL_IPEMTFC_MASK        (0x4000U)
#define GMAC_MTL_DPP_CONTROL_IPEMTFC_SHIFT       (14U)
#define GMAC_MTL_DPP_CONTROL_IPEMTFC_WIDTH       (1U)
#define GMAC_MTL_DPP_CONTROL_IPEMTFC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPEMTFC_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPEMTFC_MASK)

#define GMAC_MTL_DPP_CONTROL_IPEMRWC_MASK        (0x8000U)
#define GMAC_MTL_DPP_CONTROL_IPEMRWC_SHIFT       (15U)
#define GMAC_MTL_DPP_CONTROL_IPEMRWC_WIDTH       (1U)
#define GMAC_MTL_DPP_CONTROL_IPEMRWC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_IPEMRWC_SHIFT)) & GMAC_MTL_DPP_CONTROL_IPEMRWC_MASK)

