rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24_SHIFT (24U)
#define GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24_WIDTH (8U)
#define GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24_SHIFT)) & GMAC_MTL_TXQ0_ETS_STATUS_Reserved_31_24_MASK)
/*! @} */

/*! @name MTL_TXQ0_QUANTUM_WEIGHT -  */
/*! @{ */

#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK  (0x1FFFFFU)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT (0U)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_WIDTH (21U)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT)) & GMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK)

#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21_MASK (0xFFE00000U)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21_SHIFT (21U)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21_WIDTH (11U)
#define GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21_SHIFT)) & GMAC_MTL_TXQ0_QUANTUM_WEIGHT_Reserved_31_21_MASK)
/*! @} */

/*! @name MTL_Q0_INTERRUPT_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK (0x1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT (0U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK (0x2U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK (0xFCU)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT (2U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2_WIDTH (6U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_MASK (0x100U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT (8U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK (0x200U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT (9U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK (0xFC00U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT (10U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10_WIDTH (6U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK (0x10000U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT (16U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK (0xFE0000U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT (17U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17_WIDTH (7U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_MASK (0x1000000U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT (24U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_WIDTH (1U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE_MASK)

#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK (0xFE000000U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT (25U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25_WIDTH (7U)
#define GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT)) & GMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK)
/*! @} */

/*! @name MTL_RXQ0_OPERATION_MODE -  */
/*! @{ */

#define GMAC_MTL_RXQ0_OPERATION_MODE_RTC_MASK    (0x3U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_RTC_SHIFT   (0U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_RTC_WIDTH   (2U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_RTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_OPERATION_MODE_RTC_SHIFT)) & GMAC_MTL_RXQ0_OPERATION_MODE_RTC_MASK)

#define GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2_MASK (0x4U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2_SHIFT (2U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2_WIDTH (1U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2_SHIFT)) & GMAC_MTL_RXQ0_OPERATION_MODE_Reserved_2_MASK)

#define GMAC_MTL_RXQ0_OPERATION_MODE_FUP_MASK    (0x8U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FUP_SHIFT   (3U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FUP_WIDTH   (1U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FUP(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_OPERATION_MODE_FUP_SHIFT)) & GMAC_MTL_RXQ0_OPERATION_MODE_FUP_MASK)

#define GMAC_MTL_RXQ0_OPERATION_MODE_FEP_MASK    (0x10U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FEP_SHIFT   (4U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FEP_WIDTH   (1U)
#define GMAC_MTL_RXQ0_OPERATION_MODE_FEP(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_OPERATION_MODE_FEP_SHIFT)) & GMAC_MTL_RXQ0_OPERATION_MODE_FEP_MASK)

