rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_MTL_RXQ0_DEBUG_RRCSTS_MASK          (0x6U)
#define GMAC_MTL_RXQ0_DEBUG_RRCSTS_SHIFT         (1U)
#define GMAC_MTL_RXQ0_DEBUG_RRCSTS_WIDTH         (2U)
#define GMAC_MTL_RXQ0_DEBUG_RRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_RRCSTS_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_RRCSTS_MASK)

#define GMAC_MTL_RXQ0_DEBUG_Reserved_3_MASK      (0x8U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_3_SHIFT     (3U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_3_WIDTH     (1U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_Reserved_3_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_Reserved_3_MASK)

#define GMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK          (0x30U)
#define GMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT         (4U)
#define GMAC_MTL_RXQ0_DEBUG_RXQSTS_WIDTH         (2U)
#define GMAC_MTL_RXQ0_DEBUG_RXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK)

#define GMAC_MTL_RXQ0_DEBUG_Reserved_15_6_MASK   (0xFFC0U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_15_6_SHIFT  (6U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_15_6_WIDTH  (10U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_15_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_Reserved_15_6_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_Reserved_15_6_MASK)

#define GMAC_MTL_RXQ0_DEBUG_PRXQ_MASK            (0x3FFF0000U)
#define GMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT           (16U)
#define GMAC_MTL_RXQ0_DEBUG_PRXQ_WIDTH           (14U)
#define GMAC_MTL_RXQ0_DEBUG_PRXQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_PRXQ_MASK)

#define GMAC_MTL_RXQ0_DEBUG_Reserved_31_30_MASK  (0xC0000000U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_31_30_SHIFT (30U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_31_30_WIDTH (2U)
#define GMAC_MTL_RXQ0_DEBUG_Reserved_31_30(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_DEBUG_Reserved_31_30_SHIFT)) & GMAC_MTL_RXQ0_DEBUG_Reserved_31_30_MASK)
/*! @} */

/*! @name MTL_RXQ0_CONTROL -  */
/*! @{ */

#define GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK      (0x7U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT     (0U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_WIDTH     (3U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT)) & GMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK)

#define GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_MASK (0x8U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_SHIFT (3U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_WIDTH (1U)
#define GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_SHIFT)) & GMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_MASK)

#define GMAC_MTL_RXQ0_CONTROL_Reserved_31_4_MASK (0xFFFFFFF0U)
#define GMAC_MTL_RXQ0_CONTROL_Reserved_31_4_SHIFT (4U)
#define GMAC_MTL_RXQ0_CONTROL_Reserved_31_4_WIDTH (28U)
#define GMAC_MTL_RXQ0_CONTROL_Reserved_31_4(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ0_CONTROL_Reserved_31_4_SHIFT)) & GMAC_MTL_RXQ0_CONTROL_Reserved_31_4_MASK)
/*! @} */

/*! @name MTL_TXQ1_OPERATION_MODE -  */
/*! @{ */

#define GMAC_MTL_TXQ1_OPERATION_MODE_FTQ_MASK    (0x1U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_FTQ_SHIFT   (0U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_FTQ_WIDTH   (1U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_FTQ(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_FTQ_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_FTQ_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_TSF_MASK    (0x2U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TSF_SHIFT   (1U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TSF_WIDTH   (1U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TSF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_TSF_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_TSF_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK  (0xCU)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT (2U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_WIDTH (2U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK    (0x70U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT   (4U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TTC_WIDTH   (3U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7_MASK (0xFF80U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7_SHIFT (7U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7_WIDTH (9U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_15_7_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK    (0x3F0000U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT   (16U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TQS_WIDTH   (6U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_TQS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK)

#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y_MASK (0xFFC00000U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y_SHIFT (22U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y_WIDTH (10U)
#define GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y_SHIFT)) & GMAC_MTL_TXQ1_OPERATION_MODE_Reserved_31_y_MASK)
/*! @} */

/*! @name MTL_TXQ1_UNDERFLOW -  */
/*! @{ */

#define GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK    (0x7FFU)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT   (0U)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_WIDTH   (11U)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT)) & GMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK)

#define GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_MASK    (0x800U)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_SHIFT   (11U)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_WIDTH   (1U)
#define GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_SHIFT)) & GMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_MASK)

#define GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12_MASK (0xFFFFF000U)
#define GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12_SHIFT (12U)
#define GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12_WIDTH (20U)
#define GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12_SHIFT)) & GMAC_MTL_TXQ1_UNDERFLOW_Reserved_31_12_MASK)
/*! @} */

/*! @name MTL_TXQ1_DEBUG -  */
/*! @{ */

#define GMAC_MTL_TXQ1_DEBUG_TXQPAUSED_MASK       (0x1U)
#define GMAC_MTL_TXQ1_DEBUG_TXQPAUSED_SHIFT      (0U)
#define GMAC_MTL_TXQ1_DEBUG_TXQPAUSED_WIDTH      (1U)
#define GMAC_MTL_TXQ1_DEBUG_TXQPAUSED(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_TXQPAUSED_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_TXQPAUSED_MASK)

#define GMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK          (0x6U)
#define GMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT         (1U)
#define GMAC_MTL_TXQ1_DEBUG_TRCSTS_WIDTH         (2U)
#define GMAC_MTL_TXQ1_DEBUG_TRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK)

#define GMAC_MTL_TXQ1_DEBUG_TWCSTS_MASK          (0x8U)
#define GMAC_MTL_TXQ1_DEBUG_TWCSTS_SHIFT         (3U)
#define GMAC_MTL_TXQ1_DEBUG_TWCSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ1_DEBUG_TWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_TWCSTS_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_TWCSTS_MASK)

#define GMAC_MTL_TXQ1_DEBUG_TXQSTS_MASK          (0x10U)
#define GMAC_MTL_TXQ1_DEBUG_TXQSTS_SHIFT         (4U)
#define GMAC_MTL_TXQ1_DEBUG_TXQSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ1_DEBUG_TXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_TXQSTS_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_TXQSTS_MASK)

#define GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_MASK       (0x20U)
#define GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_SHIFT      (5U)
#define GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_WIDTH      (1U)
#define GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_MASK)

#define GMAC_MTL_TXQ1_DEBUG_Reserved_15_6_MASK   (0xFFC0U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_15_6_SHIFT  (6U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_15_6_WIDTH  (10U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_15_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_Reserved_15_6_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_Reserved_15_6_MASK)

