rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name MTL_TXQ2_SENDSLOPECREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC_MASK   (0x3FFFU)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC_SHIFT  (0U)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC_WIDTH  (14U)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC_SHIFT)) & GMAC_MTL_TXQ2_SENDSLOPECREDIT_SSC_MASK)

#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14_MASK (0xFFFFC000U)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14_SHIFT (14U)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14_WIDTH (18U)
#define GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14_SHIFT)) & GMAC_MTL_TXQ2_SENDSLOPECREDIT_Reserved_31_14_MASK)
/*! @} */

/*! @name MTL_TXQ2_HICREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ2_HICREDIT_HC_MASK           (0x1FFFFFFFU)
#define GMAC_MTL_TXQ2_HICREDIT_HC_SHIFT          (0U)
#define GMAC_MTL_TXQ2_HICREDIT_HC_WIDTH          (29U)
#define GMAC_MTL_TXQ2_HICREDIT_HC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_HICREDIT_HC_SHIFT)) & GMAC_MTL_TXQ2_HICREDIT_HC_MASK)

#define GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29_SHIFT)) & GMAC_MTL_TXQ2_HICREDIT_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_TXQ2_LOCREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ2_LOCREDIT_LC_MASK           (0x1FFFFFFFU)
#define GMAC_MTL_TXQ2_LOCREDIT_LC_SHIFT          (0U)
#define GMAC_MTL_TXQ2_LOCREDIT_LC_WIDTH          (29U)
#define GMAC_MTL_TXQ2_LOCREDIT_LC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_LOCREDIT_LC_SHIFT)) & GMAC_MTL_TXQ2_LOCREDIT_LC_MASK)

#define GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29_SHIFT)) & GMAC_MTL_TXQ2_LOCREDIT_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_Q2_INTERRUPT_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK (0x1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT (0U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK (0x2U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK (0xFCU)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT (2U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2_WIDTH (6U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE_MASK (0x100U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT (8U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_TXUIE_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK (0x200U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT (9U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK (0xFC00U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT (10U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10_WIDTH (6U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK (0x10000U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT (16U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK (0xFE0000U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT (17U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17_WIDTH (7U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE_MASK (0x1000000U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT (24U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE_WIDTH (1U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_RXOIE_MASK)

#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK (0xFE000000U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT (25U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25_WIDTH (7U)
#define GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT)) & GMAC_MTL_Q2_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK)
/*! @} */

/*! @name MTL_RXQ2_OPERATION_MODE -  */
/*! @{ */

