rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI_MASK (0x80000000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI_SHIFT (31U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_EN_LPI_MASK)
/*! @} */

/*! @name DMA_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_DMA_INTERRUPT_STATUS_DC0IS_MASK     (0x1U)
#define GMAC_DMA_INTERRUPT_STATUS_DC0IS_SHIFT    (0U)
#define GMAC_DMA_INTERRUPT_STATUS_DC0IS_WIDTH    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_DC0IS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_DC0IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_DC0IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_DC1IS_MASK     (0x2U)
#define GMAC_DMA_INTERRUPT_STATUS_DC1IS_SHIFT    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_DC1IS_WIDTH    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_DC1IS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_DC1IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_DC1IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_DC2IS_MASK     (0x4U)
#define GMAC_DMA_INTERRUPT_STATUS_DC2IS_SHIFT    (2U)
#define GMAC_DMA_INTERRUPT_STATUS_DC2IS_WIDTH    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_DC2IS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_DC2IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_DC2IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS_MASK (0x8U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS_SHIFT (3U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS_WIDTH (1U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_DC3IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS_MASK (0x10U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS_SHIFT (4U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS_WIDTH (1U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_DC4IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS_MASK (0x20U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS_SHIFT (5U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS_WIDTH (1U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_DC5IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS_MASK (0x40U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS_SHIFT (6U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS_WIDTH (1U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_DC6IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS_MASK (0x80U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS_SHIFT (7U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS_WIDTH (1U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_DC7IS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8_MASK (0xFF00U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8_SHIFT (8U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8_WIDTH (8U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_15_8_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_MTLIS_MASK     (0x10000U)
#define GMAC_DMA_INTERRUPT_STATUS_MTLIS_SHIFT    (16U)
#define GMAC_DMA_INTERRUPT_STATUS_MTLIS_WIDTH    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_MTLIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_MTLIS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_MTLIS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_MACIS_MASK     (0x20000U)
#define GMAC_DMA_INTERRUPT_STATUS_MACIS_SHIFT    (17U)
#define GMAC_DMA_INTERRUPT_STATUS_MACIS_WIDTH    (1U)
#define GMAC_DMA_INTERRUPT_STATUS_MACIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_MACIS_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_MACIS_MASK)

#define GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18_MASK (0xFFFC0000U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18_SHIFT (18U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18_WIDTH (14U)
#define GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18_SHIFT)) & GMAC_DMA_INTERRUPT_STATUS_Reserved_31_18_MASK)
/*! @} */

/*! @name DMA_DEBUG_STATUS0 -  */
/*! @{ */

#define GMAC_DMA_DEBUG_STATUS0_AXWHSTS_MASK      (0x1U)
#define GMAC_DMA_DEBUG_STATUS0_AXWHSTS_SHIFT     (0U)
#define GMAC_DMA_DEBUG_STATUS0_AXWHSTS_WIDTH     (1U)
#define GMAC_DMA_DEBUG_STATUS0_AXWHSTS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_AXWHSTS_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_AXWHSTS_MASK)

#define GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS_MASK (0x2U)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS_SHIFT (1U)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS_WIDTH (1U)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_Reserved_AXRHSTS_MASK)

#define GMAC_DMA_DEBUG_STATUS0_Reserved_7_2_MASK (0xFCU)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_7_2_SHIFT (2U)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_7_2_WIDTH (6U)
#define GMAC_DMA_DEBUG_STATUS0_Reserved_7_2(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_Reserved_7_2_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_Reserved_7_2_MASK)

#define GMAC_DMA_DEBUG_STATUS0_RPS0_MASK         (0xF00U)
#define GMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT        (8U)
#define GMAC_DMA_DEBUG_STATUS0_RPS0_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_RPS0(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_RPS0_MASK)

#define GMAC_DMA_DEBUG_STATUS0_TPS0_MASK         (0xF000U)
#define GMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT        (12U)
#define GMAC_DMA_DEBUG_STATUS0_TPS0_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_TPS0(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_TPS0_MASK)

#define GMAC_DMA_DEBUG_STATUS0_RPS1_MASK         (0xF0000U)
#define GMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT        (16U)
#define GMAC_DMA_DEBUG_STATUS0_RPS1_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_RPS1(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_RPS1_MASK)

#define GMAC_DMA_DEBUG_STATUS0_TPS1_MASK         (0xF00000U)
#define GMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT        (20U)
#define GMAC_DMA_DEBUG_STATUS0_TPS1_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_TPS1(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_TPS1_MASK)

#define GMAC_DMA_DEBUG_STATUS0_RPS2_MASK         (0xF000000U)
#define GMAC_DMA_DEBUG_STATUS0_RPS2_SHIFT        (24U)
#define GMAC_DMA_DEBUG_STATUS0_RPS2_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_RPS2(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_RPS2_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_RPS2_MASK)

#define GMAC_DMA_DEBUG_STATUS0_TPS2_MASK         (0xF0000000U)
#define GMAC_DMA_DEBUG_STATUS0_TPS2_SHIFT        (28U)
#define GMAC_DMA_DEBUG_STATUS0_TPS2_WIDTH        (4U)
#define GMAC_DMA_DEBUG_STATUS0_TPS2(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_DEBUG_STATUS0_TPS2_SHIFT)) & GMAC_DMA_DEBUG_STATUS0_TPS2_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL0 -  */
/*! @{ */

#define GMAC_DMA_TBS_CTRL0_FTOV_MASK             (0x1U)
#define GMAC_DMA_TBS_CTRL0_FTOV_SHIFT            (0U)
#define GMAC_DMA_TBS_CTRL0_FTOV_WIDTH            (1U)
#define GMAC_DMA_TBS_CTRL0_FTOV(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL0_FTOV_SHIFT)) & GMAC_DMA_TBS_CTRL0_FTOV_MASK)

