rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK (0x1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT (0U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK (0x2U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2_MASK (0xFFFFFFCU)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2_SHIFT (2U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2_WIDTH (26U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_27_2_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK (0x10000000U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT (28U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK (0x20000000U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT (29U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30_MASK (0x40000000U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30_SHIFT (30U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_Reserved_30_MASK)

#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK (0x80000000U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT (31U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_WIDTH (1U)
#define GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT)) & GMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK)
/*! @} */

/*! @name DMA_CH0_CONTROL -  */
/*! @{ */

#define GMAC_DMA_CH0_CONTROL_Reserved_MSS_MASK   (0x3FFFU)
#define GMAC_DMA_CH0_CONTROL_Reserved_MSS_SHIFT  (0U)
#define GMAC_DMA_CH0_CONTROL_Reserved_MSS_WIDTH  (14U)
#define GMAC_DMA_CH0_CONTROL_Reserved_MSS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_Reserved_MSS_SHIFT)) & GMAC_DMA_CH0_CONTROL_Reserved_MSS_MASK)

#define GMAC_DMA_CH0_CONTROL_Reserved_15_14_MASK (0xC000U)
#define GMAC_DMA_CH0_CONTROL_Reserved_15_14_SHIFT (14U)
#define GMAC_DMA_CH0_CONTROL_Reserved_15_14_WIDTH (2U)
#define GMAC_DMA_CH0_CONTROL_Reserved_15_14(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_Reserved_15_14_SHIFT)) & GMAC_DMA_CH0_CONTROL_Reserved_15_14_MASK)

#define GMAC_DMA_CH0_CONTROL_PBLx8_MASK          (0x10000U)
#define GMAC_DMA_CH0_CONTROL_PBLx8_SHIFT         (16U)
#define GMAC_DMA_CH0_CONTROL_PBLx8_WIDTH         (1U)
#define GMAC_DMA_CH0_CONTROL_PBLx8(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_PBLx8_SHIFT)) & GMAC_DMA_CH0_CONTROL_PBLx8_MASK)

#define GMAC_DMA_CH0_CONTROL_Reserved_17_MASK    (0x20000U)
#define GMAC_DMA_CH0_CONTROL_Reserved_17_SHIFT   (17U)
#define GMAC_DMA_CH0_CONTROL_Reserved_17_WIDTH   (1U)
#define GMAC_DMA_CH0_CONTROL_Reserved_17(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_Reserved_17_SHIFT)) & GMAC_DMA_CH0_CONTROL_Reserved_17_MASK)

#define GMAC_DMA_CH0_CONTROL_DSL_MASK            (0x1C0000U)
#define GMAC_DMA_CH0_CONTROL_DSL_SHIFT           (18U)
#define GMAC_DMA_CH0_CONTROL_DSL_WIDTH           (3U)
#define GMAC_DMA_CH0_CONTROL_DSL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_DSL_SHIFT)) & GMAC_DMA_CH0_CONTROL_DSL_MASK)

#define GMAC_DMA_CH0_CONTROL_Reserved_23_21_MASK (0xE00000U)
#define GMAC_DMA_CH0_CONTROL_Reserved_23_21_SHIFT (21U)
#define GMAC_DMA_CH0_CONTROL_Reserved_23_21_WIDTH (3U)
#define GMAC_DMA_CH0_CONTROL_Reserved_23_21(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_Reserved_23_21_SHIFT)) & GMAC_DMA_CH0_CONTROL_Reserved_23_21_MASK)

#define GMAC_DMA_CH0_CONTROL_SPH_MASK            (0x1000000U)
#define GMAC_DMA_CH0_CONTROL_SPH_SHIFT           (24U)
#define GMAC_DMA_CH0_CONTROL_SPH_WIDTH           (1U)
#define GMAC_DMA_CH0_CONTROL_SPH(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_SPH_SHIFT)) & GMAC_DMA_CH0_CONTROL_SPH_MASK)

#define GMAC_DMA_CH0_CONTROL_Reserved_31_25_MASK (0xFE000000U)
#define GMAC_DMA_CH0_CONTROL_Reserved_31_25_SHIFT (25U)
#define GMAC_DMA_CH0_CONTROL_Reserved_31_25_WIDTH (7U)
#define GMAC_DMA_CH0_CONTROL_Reserved_31_25(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_CONTROL_Reserved_31_25_SHIFT)) & GMAC_DMA_CH0_CONTROL_Reserved_31_25_MASK)
/*! @} */

/*! @name DMA_CH0_TX_CONTROL -  */
/*! @{ */

#define GMAC_DMA_CH0_TX_CONTROL_ST_MASK          (0x1U)
#define GMAC_DMA_CH0_TX_CONTROL_ST_SHIFT         (0U)
#define GMAC_DMA_CH0_TX_CONTROL_ST_WIDTH         (1U)
#define GMAC_DMA_CH0_TX_CONTROL_ST(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_TX_CONTROL_ST_SHIFT)) & GMAC_DMA_CH0_TX_CONTROL_ST_MASK)

#define GMAC_DMA_CH0_TX_CONTROL_TCW_MASK         (0xEU)
#define GMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT        (1U)
#define GMAC_DMA_CH0_TX_CONTROL_TCW_WIDTH        (3U)
#define GMAC_DMA_CH0_TX_CONTROL_TCW(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT)) & GMAC_DMA_CH0_TX_CONTROL_TCW_MASK)

#define GMAC_DMA_CH0_TX_CONTROL_OSF_MASK         (0x10U)
#define GMAC_DMA_CH0_TX_CONTROL_OSF_SHIFT        (4U)
#define GMAC_DMA_CH0_TX_CONTROL_OSF_WIDTH        (1U)
#define GMAC_DMA_CH0_TX_CONTROL_OSF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_TX_CONTROL_OSF_SHIFT)) & GMAC_DMA_CH0_TX_CONTROL_OSF_MASK)

#define GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5_MASK (0xFE0U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5_SHIFT (5U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5_WIDTH (7U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5_SHIFT)) & GMAC_DMA_CH0_TX_CONTROL_Reserved_11_5_MASK)

#define GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE_MASK (0x1000U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE_SHIFT (12U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE_WIDTH (1U)
#define GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE_SHIFT)) & GMAC_DMA_CH0_TX_CONTROL_Reserved_TSE_MASK)

