rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_DMA_CH1_RX_CONTROL_RPF_MASK         (0x80000000U)
#define GMAC_DMA_CH1_RX_CONTROL_RPF_SHIFT        (31U)
#define GMAC_DMA_CH1_RX_CONTROL_RPF_WIDTH        (1U)
#define GMAC_DMA_CH1_RX_CONTROL_RPF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_CONTROL_RPF_SHIFT)) & GMAC_DMA_CH1_RX_CONTROL_RPF_MASK)
/*! @} */

/*! @name DMA_CH1_TXDESC_LIST_ADDRESS -  */
/*! @{ */

#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT)) & GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_Reserved_LSb_MASK)

#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_SHIFT (3U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_WIDTH (29U)
#define GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_SHIFT)) & GMAC_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_MASK)
/*! @} */

/*! @name DMA_CH1_RXDESC_LIST_ADDRESS -  */
/*! @{ */

#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT)) & GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_Reserved_LSb_MASK)

#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_SHIFT (3U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_WIDTH (29U)
#define GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_SHIFT)) & GMAC_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_MASK)
/*! @} */

/*! @name DMA_CH1_TXDESC_TAIL_POINTER -  */
/*! @{ */

#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb_SHIFT)) & GMAC_DMA_CH1_TXDESC_TAIL_POINTER_Reserved_LSb_MASK)

#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_SHIFT (3U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_WIDTH (29U)
#define GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_SHIFT)) & GMAC_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_MASK)
/*! @} */

/*! @name DMA_CH1_RXDESC_TAIL_POINTER -  */
/*! @{ */

#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb_SHIFT)) & GMAC_DMA_CH1_RXDESC_TAIL_POINTER_Reserved_LSb_MASK)

#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_SHIFT (3U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_WIDTH (29U)
#define GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_SHIFT)) & GMAC_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_MASK)
/*! @} */

/*! @name DMA_CH1_TXDESC_RING_LENGTH -  */
/*! @{ */

#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL_MASK (0x3FFU)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL_SHIFT (0U)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL_WIDTH (10U)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL_SHIFT)) & GMAC_DMA_CH1_TXDESC_RING_LENGTH_TDRL_MASK)

#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10_MASK (0xFFFFFC00U)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10_SHIFT (10U)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10_WIDTH (22U)
#define GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10_SHIFT)) & GMAC_DMA_CH1_TXDESC_RING_LENGTH_Reserved_31_10_MASK)
/*! @} */

/*! @name DMA_CH1_RX_CONTROL2 -  */
/*! @{ */

#define GMAC_DMA_CH1_RX_CONTROL2_RDRL_MASK       (0x3FFU)
#define GMAC_DMA_CH1_RX_CONTROL2_RDRL_SHIFT      (0U)
#define GMAC_DMA_CH1_RX_CONTROL2_RDRL_WIDTH      (10U)
#define GMAC_DMA_CH1_RX_CONTROL2_RDRL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_CONTROL2_RDRL_SHIFT)) & GMAC_DMA_CH1_RX_CONTROL2_RDRL_MASK)

#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10_MASK (0x1FC00U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10_SHIFT (10U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10_WIDTH (7U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10_SHIFT)) & GMAC_DMA_CH1_RX_CONTROL2_Reserved_x_10_MASK)

#define GMAC_DMA_CH1_RX_CONTROL2_ARBS_MASK       (0xFE0000U)
#define GMAC_DMA_CH1_RX_CONTROL2_ARBS_SHIFT      (17U)
#define GMAC_DMA_CH1_RX_CONTROL2_ARBS_WIDTH      (7U)
#define GMAC_DMA_CH1_RX_CONTROL2_ARBS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_CONTROL2_ARBS_SHIFT)) & GMAC_DMA_CH1_RX_CONTROL2_ARBS_MASK)

#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24_SHIFT (24U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24_WIDTH (8U)
#define GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24_SHIFT)) & GMAC_DMA_CH1_RX_CONTROL2_Reserved_31_24_MASK)
/*! @} */

/*! @name DMA_CH1_INTERRUPT_ENABLE -  */
/*! @{ */

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE_MASK   (0x1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE_SHIFT  (0U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE_WIDTH  (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_TIE_MASK)

