rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE_MASK  (0x2U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE_SHIFT (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_TXSE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE_MASK  (0x4U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE_SHIFT (2U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_TBUE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3_MASK (0x38U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3_SHIFT (3U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3_WIDTH (3U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_5_3_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE_MASK   (0x40U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE_SHIFT  (6U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE_WIDTH  (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_RIE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE_MASK  (0x80U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE_SHIFT (7U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_RBUE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE_MASK   (0x100U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE_SHIFT  (8U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE_WIDTH  (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_RSE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE_MASK  (0x200U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE_SHIFT (9U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_RWTE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE_MASK  (0x400U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE_SHIFT (10U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_ETIE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE_MASK  (0x800U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE_SHIFT (11U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_ERIE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE_MASK  (0x1000U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE_SHIFT (12U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_FBEE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE_MASK  (0x2000U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE_SHIFT (13U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE_WIDTH (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_CDEE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE_MASK   (0x4000U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE_SHIFT  (14U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE_WIDTH  (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_AIE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE_MASK   (0x8000U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE_SHIFT  (15U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE_WIDTH  (1U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_NIE_MASK)

#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16_SHIFT (16U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16_WIDTH (16U)
#define GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16_SHIFT)) & GMAC_DMA_CH1_INTERRUPT_ENABLE_Reserved_31_16_MASK)
/*! @} */

/*! @name DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER -  */
/*! @{ */

#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK (0xFFU)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT (0U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_WIDTH (8U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT)) & GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK)

#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_MASK (0xFF00U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_SHIFT (8U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_WIDTH (8U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_SHIFT)) & GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_MASK)

#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK (0x30000U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT (16U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_WIDTH (2U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT)) & GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK)

