rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
/*! @name DMA_CH2_CONTROL -  */
/*! @{ */

#define GMAC_DMA_CH2_CONTROL_Reserved_MSS_MASK   (0x3FFFU)
#define GMAC_DMA_CH2_CONTROL_Reserved_MSS_SHIFT  (0U)
#define GMAC_DMA_CH2_CONTROL_Reserved_MSS_WIDTH  (14U)
#define GMAC_DMA_CH2_CONTROL_Reserved_MSS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_Reserved_MSS_SHIFT)) & GMAC_DMA_CH2_CONTROL_Reserved_MSS_MASK)

#define GMAC_DMA_CH2_CONTROL_Reserved_15_14_MASK (0xC000U)
#define GMAC_DMA_CH2_CONTROL_Reserved_15_14_SHIFT (14U)
#define GMAC_DMA_CH2_CONTROL_Reserved_15_14_WIDTH (2U)
#define GMAC_DMA_CH2_CONTROL_Reserved_15_14(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_Reserved_15_14_SHIFT)) & GMAC_DMA_CH2_CONTROL_Reserved_15_14_MASK)

#define GMAC_DMA_CH2_CONTROL_PBLx8_MASK          (0x10000U)
#define GMAC_DMA_CH2_CONTROL_PBLx8_SHIFT         (16U)
#define GMAC_DMA_CH2_CONTROL_PBLx8_WIDTH         (1U)
#define GMAC_DMA_CH2_CONTROL_PBLx8(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_PBLx8_SHIFT)) & GMAC_DMA_CH2_CONTROL_PBLx8_MASK)

#define GMAC_DMA_CH2_CONTROL_Reserved_17_MASK    (0x20000U)
#define GMAC_DMA_CH2_CONTROL_Reserved_17_SHIFT   (17U)
#define GMAC_DMA_CH2_CONTROL_Reserved_17_WIDTH   (1U)
#define GMAC_DMA_CH2_CONTROL_Reserved_17(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_Reserved_17_SHIFT)) & GMAC_DMA_CH2_CONTROL_Reserved_17_MASK)

#define GMAC_DMA_CH2_CONTROL_DSL_MASK            (0x1C0000U)
#define GMAC_DMA_CH2_CONTROL_DSL_SHIFT           (18U)
#define GMAC_DMA_CH2_CONTROL_DSL_WIDTH           (3U)
#define GMAC_DMA_CH2_CONTROL_DSL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_DSL_SHIFT)) & GMAC_DMA_CH2_CONTROL_DSL_MASK)

#define GMAC_DMA_CH2_CONTROL_Reserved_23_21_MASK (0xE00000U)
#define GMAC_DMA_CH2_CONTROL_Reserved_23_21_SHIFT (21U)
#define GMAC_DMA_CH2_CONTROL_Reserved_23_21_WIDTH (3U)
#define GMAC_DMA_CH2_CONTROL_Reserved_23_21(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_Reserved_23_21_SHIFT)) & GMAC_DMA_CH2_CONTROL_Reserved_23_21_MASK)

#define GMAC_DMA_CH2_CONTROL_SPH_MASK            (0x1000000U)
#define GMAC_DMA_CH2_CONTROL_SPH_SHIFT           (24U)
#define GMAC_DMA_CH2_CONTROL_SPH_WIDTH           (1U)
#define GMAC_DMA_CH2_CONTROL_SPH(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_SPH_SHIFT)) & GMAC_DMA_CH2_CONTROL_SPH_MASK)

#define GMAC_DMA_CH2_CONTROL_Reserved_31_25_MASK (0xFE000000U)
#define GMAC_DMA_CH2_CONTROL_Reserved_31_25_SHIFT (25U)
#define GMAC_DMA_CH2_CONTROL_Reserved_31_25_WIDTH (7U)
#define GMAC_DMA_CH2_CONTROL_Reserved_31_25(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CONTROL_Reserved_31_25_SHIFT)) & GMAC_DMA_CH2_CONTROL_Reserved_31_25_MASK)
/*! @} */

/*! @name DMA_CH2_TX_CONTROL -  */
/*! @{ */

#define GMAC_DMA_CH2_TX_CONTROL_ST_MASK          (0x1U)
#define GMAC_DMA_CH2_TX_CONTROL_ST_SHIFT         (0U)
#define GMAC_DMA_CH2_TX_CONTROL_ST_WIDTH         (1U)
#define GMAC_DMA_CH2_TX_CONTROL_ST(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_ST_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_ST_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_TCW_MASK         (0xEU)
#define GMAC_DMA_CH2_TX_CONTROL_TCW_SHIFT        (1U)
#define GMAC_DMA_CH2_TX_CONTROL_TCW_WIDTH        (3U)
#define GMAC_DMA_CH2_TX_CONTROL_TCW(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_TCW_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_TCW_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_OSF_MASK         (0x10U)
#define GMAC_DMA_CH2_TX_CONTROL_OSF_SHIFT        (4U)
#define GMAC_DMA_CH2_TX_CONTROL_OSF_WIDTH        (1U)
#define GMAC_DMA_CH2_TX_CONTROL_OSF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_OSF_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_OSF_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5_MASK (0xFE0U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5_SHIFT (5U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5_WIDTH (7U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_11_5_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MASK (0x1000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_SHIFT (12U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_WIDTH (1U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE_MASK (0x6000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE_SHIFT (13U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE_WIDTH (2U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_TSE_MODE_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL_MASK (0x8000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL_SHIFT (15U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL_WIDTH (1U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_IPBL_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_TxPBL_MASK       (0x3F0000U)
#define GMAC_DMA_CH2_TX_CONTROL_TxPBL_SHIFT      (16U)
#define GMAC_DMA_CH2_TX_CONTROL_TxPBL_WIDTH      (6U)
#define GMAC_DMA_CH2_TX_CONTROL_TxPBL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_TxPBL_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_TxPBL_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_ETIC_MASK        (0x400000U)
#define GMAC_DMA_CH2_TX_CONTROL_ETIC_SHIFT       (22U)
#define GMAC_DMA_CH2_TX_CONTROL_ETIC_WIDTH       (1U)
#define GMAC_DMA_CH2_TX_CONTROL_ETIC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_ETIC_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_ETIC_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_23_MASK (0x800000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_23_SHIFT (23U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_23_WIDTH (1U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_23(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_23_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_23_MASK)

