rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_GMAC.h
#define GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16_SHIFT (16U)
#define GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16_WIDTH (16U)
#define GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16_SHIFT)) & GMAC_DMA_CH2_MISS_FRAME_CNT_Reserved_31_16_MASK)
/*! @} */

/*! @name DMA_CH2_RXP_ACCEPT_CNT -  */
/*! @{ */

#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC_MASK   (0x7FFFFFFFU)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC_SHIFT  (0U)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC_WIDTH  (31U)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC_SHIFT)) & GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPAC_MASK)

#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF_MASK (0x80000000U)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF_SHIFT (31U)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF_WIDTH (1U)
#define GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF_SHIFT)) & GMAC_DMA_CH2_RXP_ACCEPT_CNT_RXPACOF_MASK)
/*! @} */

/*! @name DMA_CH2_RX_ERI_CNT -  */
/*! @{ */

#define GMAC_DMA_CH2_RX_ERI_CNT_ECNT_MASK        (0xFFFU)
#define GMAC_DMA_CH2_RX_ERI_CNT_ECNT_SHIFT       (0U)
#define GMAC_DMA_CH2_RX_ERI_CNT_ECNT_WIDTH       (12U)
#define GMAC_DMA_CH2_RX_ERI_CNT_ECNT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_ERI_CNT_ECNT_SHIFT)) & GMAC_DMA_CH2_RX_ERI_CNT_ECNT_MASK)

#define GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12_MASK (0xFFFFF000U)
#define GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12_SHIFT (12U)
#define GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12_WIDTH (20U)
#define GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12_SHIFT)) & GMAC_DMA_CH2_RX_ERI_CNT_Reserved_31_12_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group GMAC_Register_Masks */

/*!
 * @}
 */ /* end of group GMAC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_GMAC_H_) */
